{"month": "2", "num": 1017, "link": "https://xkcd.com/1017/spreadsheet/", "year": "2012", "news": "", "safe_title": "Backward in Time", "transcript": "When I have a boring task to get through -- a three-hour lecture, a giant file download, or a long term point goal in fitocracy -- I use this formula to convert the percentage completed (p) into a date:\n\nT=(Current Date) - (e^(20.344p^3) - e^3) years\n\nWhen the task is 0% done, it gives today's date, and as I make progress, I move further and further back in time\n\n((inverse given in lighter colors))\nInverse: p = sqrt((ln(T+e^3)-3)\n(20.3444))\n\n[[Line Graph explaining the correlation between completion percentages and temporal deltas.\n0% = now ((Date of comic is 2012-02-14T00:00-0500, approx. 1329195600 UNIX))\n10% = September 2011\n20% = 2008\n30% = 1997\n40% = 1958\n50% = 1776\n60% = 405 AD\n70% = 22,000 years ago\n80% = 671,000 years ago\n90% = 55 million years ago\n100% = 13.8 billion years ago\n]]\n\nIt moves slowly through the first few years, then steadily accelerates. I tuned the formula so the time spent in each part of the past is loosely proportional to how well I know it. This means I hit familiar landmarks with each bit of progress, giving me a satisfying sense of movement.\n\n((The following are panels detailing completion percentages, correlated time periods, and notable events from this time period))\n\n7.308% December 18, 2011\nAround this time:\nKim Jong-Il dies. US leaves Iraq.\n\n31.12% February 1995\nAround this time:\nWindows 95 debuts. OJ found not guilty.\n\n47.91% 1844\nAround this time:\nRubber vulcanized, bicycle invented, wrench patented.\n\n70.33% 24,000 years ago\nAround this time:\nCaves painted, ceramic art made. Neanderthals extinct.\n\n90.42% 68 million years ago\nAround this time:\nFirst flowering plants.  Chicxulub impact kills off most dinosaurs.\n\n100% 13.76 billion years ago\nAround this time:\nUniverse begins. First stars ignite.\n\nDownload complete.\n\n[[Person 1 watches a download progress on a laptop in amazement and happiness.  Person 2 stands nearby and looks at person 1 with a bemused posture]]\nPerson 1: Swoosh! Watching all that time blur past is such a rush!\nPerson 2: So... you've tried to make an extreme sport out of.. *waiting*.\nPerson 1: Swoosh!\n\n{{Title text: People tell me I have too much time on my hands, but really the problem is that there's too much time, PERIOD.}}", "alt": "People tell me I have too much time on my hands, but really the problem is that there's too much time, PERIOD.", "img": "https://imgs.xkcd.com/comics/backward_in_time.png", "title": "Backward in Time", "day": "14"}