{"month": "3", "num": 1028, "link": "", "year": "2012", "news": "", "safe_title": "Communication", "transcript": "[[A guy in a hat looks down at a large gap in the walkway; a thought bubble with a warning symbol and an image of the gap appears above the guy's head.]]\n\n[[The guy walks to the right, away from the gap, and encounters another guy, to which he speaks (in iconographic speech bubble form), attempting to inform him about the gap. A thought bubble appears above the other figure's head with an image of the gesturing guy.]]\n\n[[The first guy continues, waving his arms, still talking about the gap. The second guy's thought bubble continues to contain images of the first guy gesturing frantically.]]\n\n[[The second guy shrugs in a nonplussed manner, and the first guy leaves off the right side of the frame. Both have thought bubbles displaying the other's reaction.]]\n\n[[The first guy continues to the right and comes across a woman. He tells her about the reaction of the previous guy (again in iconographic form); she simultaneously tries to tell him about a gap and gestures off to the right of the frame.]]\n\n[[The first guy and the woman both leave the frame thinking of each other's reactions; the woman exiting left and the guy exiting right.]]\n\n[[The woman (still thinking about the first guy) encounters the second guy (who is also still thinking about the first guy).]]\n\n[[The pair talk about the first guy.]]\n\n[[The pair continue talking about the first guy as they exit the frame to the left.]]\n\n[[A commotion is heard from the left.]]\n\n[[The camera pans over to the left, where the pair have fallen into a gap in the walkway. A commotion is then also heard from the right.]]\n\n[[The camera pans over to the right, where the first guy has also fallen into a gap.]]\n\n[[A third guy in a beret comes across a gap in the walkway.]]\n\n[[The guy in the beret runs off the frame to the right.]]\n\n[[The guy in the beret meets a fourth guy, and tells him (in iconographic form) to come with him. The fourth guy has a thought bubble of the guy in the beret.]]\n\n[[The guy in the beret takes the fourth guy's hand and leads him along to the left. The fourth guy's thought bubble has question marks around the guy in the beret.]]\n\n[[The guy in the beret leads the fourth guy to the gap and shows him it.]]\n\n[[Both the guy in the beret and the fourth guy walk away from the gap to the right, now both thinking about the gap.]]\n\n{{Title text: Anyone who says that they're great at communicating but 'people are bad at listening' is confused about how communication works.}}", "alt": "Anyone who says that they're great at communicating but 'people are bad at listening' is confused about how communication works.", "img": "https://imgs.xkcd.com/comics/communication.png", "title": "Communication", "day": "12"}