{"month": "4", "num": 1037, "link": "", "year": "2012", "news": "You can get posters, prints, and t-shirts in the <a href=\"https://store.xkcd.com/\">xkcd store</a>.", "safe_title": "Umwelt", "transcript": "[[Two people...]]\n\n((..wait.. <scrolls through a listing of everything> oh goddammit Randall. Thanks a bunch, dude. I better get a raise for typing out all this))\n\n[[Two people standing next to each other.  One is holding the head end of a snake.  Depending on the width of your browser, the snake is:\nthree frames, the third of which  has a little bit of a bump;\nthe first frame has a human-size bump, the second has a third person looking at the snake, and the third has the snake going though two Portals;\na squirrel and the human-size bump in the first frame, a ring next to the third person in the second frame, and Beret Guy riding the snake in front of the portal;\nor\nThe squirrel, a fourth person within the snake being coiled, and the human bump in the first frame, the ring, a fifth person in love, and the third person in the second frame, Beret Guy and the portal in the third frame, and the same two people in the fourth frame.]]\nPerson holding snake head: I found a snake, but then I forgot to stop.\n\n[[Two people sitting at a desk.  One is Black Hat Guy.  The other is an analyst.  Black Hat Guy has a number of terminals attached to his head]]\nAnalyst: You come across a tortoise in the desert. You flip it over. It struggles to right itself. You watch. You're not helping.  Why is that?\n\nBlack Hat Guy: It *knows* what it did.\n\n[[View of the entire scene, with said turtle off in the distance on its back and trying to right itself.\n\n[[A group of four scale down a wall into a field in the middle of the night.  They walk off single-file]]\nPerson 1: It's quiet.\n\nPerson 3: Yeah - *Too* quiet.\n\n[[A Velociraptor is off in the distance, following the group]]\nPerson 4: Yeah - too *too* quiet.\n\nPerson 2: Yeah - 2quiet2furious.\nPerson 1: Fuck off, Steve.\n\n[[A landscape showing a pond, some reeds, and a set of mountains off in the distance]]\n\n[[A trio of galaxies]]\nGalaxy 1: He's not looking!\nGalaxy 3: Let's get him!\n[[Lines draw in illustrating the eye-line of one of a pair of people]]\nPerson 1: So he said he didn't get the text, but c'mon, he *never* misses texts. Right? ..hello?\nPeson 2: I'm just staring at your head freaked out by th efact that there are millions of galaxies *directly behind it*.\n\n[[Person holding bat]]\nPerson: Sorry, but this comic\n\n[[Person starts to wind up]]\n*requires*\n\n[[Person prepares to strike with bat]]\nXKCD\n\n[[Person swings at a beehive]]\n*GOLD*\n\n[[Penis Bees fly out of the beehive]]\n\n[[Person yells at another person]]\nPerson 1;Oh yeah? Well you mama's so *cynical*, her only dog ballast is a *leash*!\n(This comic takes place in a dystopian future where the government is afraid dogs can hover, so it requires them to wear weights at all times, and some people privately doubt the government, but not enough to stop buying dog weights)\n\nFive seconds ago:\n[[You sitting in front of a desk, reading a reddit thread]]\nYou: Oh, hey, reddit has a link to some XKCD april fools comic.\n\nNow:\n[[An image of this very page]]\n\nFive seconds from now:\nYou: ..hey\n\n30 seconds from now:\n[[DANCE PARTY!]]\n\nPerson: What I wanna know is why do hot dogs come in packages of six while buns come in these huge sacks of ash and blood from which \"Ave Maria\" is faintly audible?\n[[Chanting sacks of gore in the background]]\n\n[[There's no comic here because instead of drawing one, I spent the last hour reading every news story cited in the Wikipedia article on \"The Mile High Club\"]]\n\n[[A twitter account page with the following:\nMany tweets, fewer following, even fewer followers,\nA bunch of assholes in the suggested follow box,\ntrending topics partitioned into: Word Games, Misogyny, and Bieber,\nstuff your eyes automatically ignore,\nA really pleasant blue.\nand the timeline:\nSomething about a podcast,\nSomeone confused because the description doesn't match the link,\nThe link you clicked on to get to this comic,\nRob Delaney,\nPassive Aggression,\nand horse_ebooks.]]\n\n[[An epic void with a bright light shining right on you]]\n\n[[A Chrome plugin error page with the characteristic jigsaw piece]]\nChrome: Chrome is looking for this piece. Have you seen it? Chrome thinks it links up with a corner.\n\n[[A Chrome plugin error page]]\nChrome: This plugin requires Sergey Brin's permission to run.  Please wait while he is woken.\n\n[[Two people; one is sitting at a desk in front of a laptop.]]\nPerson 1: Man, chrome's hardware acceleration really sucks.\nPerson 2: Oh - Theres' a great add-on that fixes it.\nPerson 1: Oh? What's it called?\nPerson 2: \"Firefox\".\n\n[[A chrome plugin error page]]\nChrome: There does not exist --nor could there *ever* exist-- a plugin capable of displaying this content.\n\n[[IE error page]]\nIE: Error: Internet Explorer has given up.\n\n[[Firefox error page]]\nFirefox: Well, this is embarassing.  You know how I'm not supposed to peek at your browsing in private mode? Firefox.. is sorry.  Firefox will not blame you if you \n[[button with text]] click here to report this incident.\n\nPerson: Maxthon? Hey, 2005 called. Didn't say anything. All I could hear was sobbing.  This is getting harder.  Anyway, yeah, Maxthon's still cool! Didn't know it was still around!\n\n[[Person with tentacle arms]]\nPerson: Netscape Navigator? Hey, the nineties called - drunk as usual.  I hung up without saying anything.  This is getting harder. Anyway - it's cool that you'e got netscape running.\n\n[[normal person]]\nPerson: Netscape Navigator? Hey, the nineties called - drunk as usual.  I hung up without saying anything.  This is getting harder. Anyway - it's cool that you'e got netscape running.\n\n[[Person running to laptop]]\nI ran to Rockmest to hide my face\n\n[[Person sitting at laptop]]\nBut Rockmelt cried out - \n\n[[Laptop shouting]]\nNO HIDING PLACE\n\n[[zoom out]]\nNO HIDING PLACE DOWN HERE\n\n[[Error page]]\nError: You have exceeded your AT&T monthly bandwidth cap.  Mobile web browsing has been disabled.\n\n[[Person looking at two browser windows]]\nI know y'all know what you're doing.  But if you're on a military machine and youre supposed to be watching for missiles or something, I hope you're keeping an eye on that in the background while you're reading comics.\nAlso: Thanks.\n\n[[Error page]]\nData Error: T-Mobile was unable to establish a connection\n\n[[Error page]]\nError; You have exceeded your Verizon monthly bandwidth cap.  Mobile web browsing has been disabled.\n\n[[Chrome error page]]\nChrome: This plugin requires clearance from the corporate press office in order to run.  Remember, Amazon is a team; individual employees should *never* speak for the company without authorization.\n\n[[Firefox error page]]\nFirefox: This plugin requires clearance from the corporate press office in order to run.  Remember, Amazon is a team; individual employees should *never* speak for the company without authorization.\n\n\n[[Chrome error page]]\nChrome: This plugin requires clearance from the corporate press office in order to run.  Remember, Google is a team; individual employees should *never* speak for the company without authorization.\n\n[[Chrome error page]]\nChrome: This plugin requires clearance from the corporate press office in order to run.  Remember, Microsoft is a team; individual employees should *never* speak for the company without authorization.\n\n[[Firefox error page]]\nFirefox: This plugin requires clearance from the corporate press office in order to run.  Remember, Microsoft is a team; individual employees should *never* speak for the company without authorization.\n\n[[Error page]]\nError: This plugin requires clearance from the corporate press office in order to run.  Remember, Microsoft is a team; individual employees should *never* speak for the company without authorization.\n\n[[Chrome error page]]\nChrome: This plugin requires clearance from the corporate press office in order to run.  Remember, The Times is a team; individual employees should *never* speak for the company without authorization.\n\n[[Error page]]\nError: This plugin requires clearance from the corporate press office in order to run.  Remember, The Times is a team; individual employees should *never* speak for the company without authorization.\n\n[[Error page]]\nError: This plugin requires clearance from the corporate press office in order to run.  Remember, We work as a team; individual employees should *never* speak for the company without authorization.\n\n[[A snowy Alaskan field]]\nPerson: Some people hunt wolves from helicopters.  I hunt helicopters from a wolf.\n\n[[TV Field Reporter in front of a cordoned-off lake]]\nPolice divers searching the bay say they have recovered thebody of another victim of the \"Lake Diver Killer\"  During the search, three more divers were reported missing.\n\nRobot Paul Revere: Remember: Zero if by land, One if by sea.\n\n[[Person unsuspectingly strolls under a giant box trap controled by a Trible.]]\nI worry that CNU only invited me back as a ruse because they realized I never turned in my final paper and want my diploma back.  But if it turns out it's for real, I'll see you wednesday at the Ferguson!\n\n[[Two people; one of which is browsing using a laptop]]\nPerson 1: Hey, you're French, right?  Ever see what happens when you type \"French Military Victories\" into Google?\nFrench person: Does it take you to an article on Napoleon?\n\nFrench person: ..no? Strange, given how he kicked everyone's asses up and down europe for over a decade.\n\n[[beat]]\n\nPerson 1: Touche.\nFrench person: You know, that'd sound smarter if you didn't pronounce it like it rhymes with \"douche\".\n\n[[A person dropping food from an unorthodox high perch]]\nJune 1948: In response to the Soviet blockade of East Germany, the western allies construct the Berlin Chairlift.\nPerson on chairlift: Food!\n\n[[The Lincoln Monument]]\nIn this Marble Prison\nAs in the nightmares of the nation they tried to devour\nThe nanobots that constituted Abraham Lincoln\nAre entombed forever.\n\n[[Person on phone]]\n((Translation from Hebrew))\nPerson: Mom, I met a great guy! But he's not Jewish.  ... Wait, what do you mean \"neither are we\"? I'm completely confused.\n\n[[Person on a motorcycle with a heat-entropy graph on the side]]\nPerson 1: Check out my new Carnot Cycle!\nPerson 2: Neat -- how fast does it go?\nPerson 1: Depends how cold it is outside.\n\n[[Illustration of the atlantic ocean]]\nAmerican person: Sorry I don't have a comic poking fun at the UK here.  I only had time to get to the most *important* US states.\nBritish person: Hey -- At least we have free health care and real ale.\n\n[[Two people in front of a group of students]]\nPerson 1: I've hired a team of MIT students to count cards for us.\nPerson 2: We'll be rich!\n\n[[Person 2 deals some cards while the students watch]]\n\n[[The gears turn..]]\n\nStudent: Five. There are five cards.\nPerson 1: I see their admission standards have been slipping.\nPerson 2: Yeah - there are actually four.\n\n[[Two people in front of a group of students]]\nPerson 1: I've hired a team of MIT students to count cards for us.\nPerson 2: We'll be rich!\n\n[[Person 2 deals some cards while the students watch]]\n\n[[The gears turn..]]\n\nStudent: Five. There are five cards.\nPerson 1: I *knew* we shouldn't have picked course 15s.\nPerson 2: Yeah - there are actually four.\n\n[[Two people in front of a group of students]]\nPerson 1: I've hired a team of Smith students to count cards for us.\nPerson 2: We'll be rich!\n\n[[Person 2 deals some cards while the students watch]]\n\n[[The gears turn..]]\n\nStudent: Five. There are five cards.\nPerson 1: We should've gone with Wellesley\nPerson 2: Yeah - there are actually four.\n\n[[Two people in front of a group of students]]\nPerson 1: I've hired a team of Wellesley students to count cards for us.\nPerson 2: We'll be rich!\n\n[[Person 2 deals some cards while the students watch]]\n\n[[The gears turn..]]\n\nStudent: Five. There are five cards.\nPerson 1: We should've gone with Smith.\nPerson 2: Yeah - there are actually four.\n\n[[Newspaper headline]]\nRIT students create life in lab\n[[caption under picture of students]]\n\"The trick was fuckin'\"\n\n[[Newspaper headline]]\nScientists create life in lab\n[[caption under picture of scientists]]\n\"The trick was fuckin'\"\n\n[[Newspaper headline]]\nUMass Amherst students create life in lab\n[[caption under picture of students]]\n\"The trick was fuckin'\"\n\n[[Person heading out past another person comfortably sitting in front of a desk]]\nPerson 1: Apparently there's a solar storm causing northern lights over Canada.  CNN say they might even be visible {{Options: \"As Far South As Us\", \"Here in Boston\", \"Maine\", \"Ohio\", \"Oregon\", \"New York\"}}! Wanna drive out to see?\nPerson 2: It's cold out.\nPerson 1: Ok. Later.\n\n[[An expansive, marvelous image of emerald green northern lights, floating down through the sky]]\n\nPerson 2: See anything?\nPerson 1: No, just clouds.\nPerson 2: Not surprised.\n\n[[Person heading out past another person comfortably sitting in front of a desk]]\nPerson 1:Apparently there's a solar flare that's causing some Great Aurorae.  CBC says they may even be visible here! Wanna drive out to see?\nPerson 2: Hockey's on.\nPerson 1: Ok. Later.\n\n[[An expansive, marvelous image of emerald green northern lights, floating down through the sky]]\n\nPerson 2: See anything?\nPerson 1: No, just clouds.\nPerson 2: Not surprised.\n\n[[Two people sitting at a desk, facing each other. The desk rattles.]]\nPerson 1: Stop jiggling your leg. \nPerson 2: I'm not ji-.. oh!\nPerson 1: What!\nPerson 2: You'll get it..\n\n[[EVERYTHING RUMBLES]]\nPerson 1: ..HOLY CRAP IT'S AN EARTHQUAKE!\nPerson 2: Just a little one. Happens all the time back in San Francisco.\n\nPerson 1: But this is {{Options: \"Alabama\", \"Boston\", \"Chicago\", \"Dallas\", \"Georgia\", \"Halifax\", \"Illinois\", \"Michigan\", \"Minnesota\", \"Missouri\", \"the Northeast\", \"Ohio\", \"Oklahoma\", \"Ottawa\", 'Pennsylvania\", \"Philadelphia\", \"Texas\", \"Toronto\", \"Tennessee\", \"New York\", \"Wisconsin\"}}! That was huge! \nPerson 2: Seriously? That's the worst this place can do? Wow. I guess we grow up tougher in California.\nPerson 1: Oh *really*...\n\nSix Months Later..\n[[Both people are trudging through a massive blizzard]]\nPerson 2: In pictures, snow always looked so nice and sof -- AAAA! MY NECK! How do people live here?!\nPerson 1: Come on - it's only three more miles.\n\n[[Two people sitting at a desk, facing each other. The desk rattles.]]\nPerson 1: Stop jiggling your leg. \nPerson 2: I'm not ji-.. oh!\nPerson 1: What!\nPerson 2: You'll get it..\n\n[[EVERYTHING RUMBLES]]\nPerson 1: ..HOLY CRAP IT'S AN EARTHQUAKE!\nPerson 2: Just a little one. Happens all the time back in San Francisco.\n\nPerson 1: But this is {{Options: \"Alabama\", \"Dallas\", \"Illinois\", \"The Midwest\", \"Missouri\", \"Ohio\", \"Oklahoma\", \"Ottawa\", \"Tennessee\", \"Texas\"}}! That was huge! \nPerson 2: Seriously? That's the worst this place can do? Wow. I guess we grow up tougher in California.\nPerson 1: Oh *really*...\n\nSix Months Later..\n[[Both people are in a shelter in a prairie with a rapidly-approaching tornado]]\nPerson 2: AAAA CLOSE THE SHELTER DOOR!\nPerson 1: Say the magic words...\nPerson 2: THIS PLACE IS THE WORST!\nPerson 1: Thank you.\n\n[[EVERYTHING RUMBLES]]\nPerson 1: ..HOLY CRAP IT'S AN EARTHQUAKE!\nPerson 2: Just a little one. Happens all the time back in San Francisco.\n\nPerson 1: But this is {{Options: \"D.C\", \"Florida\", \"Houston\", \"Miami\", \"New Jersey\", \"North Carolina\", \"South Carolina\", \"Virgina\"}}! That was huge! \nPerson 2: Seriously? That's the worst this place can do? Wow. I guess we grow up tougher in California.\nPerson 1: Oh *really*...\n\nSix Months Later..\n[[Both are in the middle of a hurricane. Person 2 is grabbing onto a signpost to avoid being swept away]]\nPerson 2: AAAAA WHAT THE SHIIIIT!\nPerson 1: Calm down - this is barely a category 2.\n\n{{Title text: Umwelt is the idea that because their senses pick up on different things, different animals in the same ecosystem actually live in very different worlds. Everything about you shapes the world you inhabit--from your ideology to your glasses prescription to your web browser.}}", "alt": "Umwelt is the idea that because their senses pick up on different things, different animals in the same ecosystem actually live in very different worlds. Everything about you shapes the world you inhabit--from your ideology to your glasses prescription to your web browser.", "img": "https://imgs.xkcd.com/comics/reviews.png", "title": "Umwelt", "extra_parts": {"pre": "<noscript>", "headerextra": "", "post": "\n</noscript>\n<script src=\"/s/abcd2b.js\"></script>\n<script src=\"/s/cd5db4.js\"></script>\n", "imgAttr": ""}, "day": "1"}