{"month": "7", "num": 1080, "link": "https://xkcd.com/1080/large/", "year": "2012", "news": "", "safe_title": "Visual Field", "transcript": "Your Central Visual Field\n\n((This comic contains numerous visual elements arranged around a central point, and are intended to represent locations in a sphere with the eyeball as the center.  Underlaid below all of the elements are concentric circles representing degrees from straight ahead, using the eyeball's point of view, denoting where these elements would appear in someone's field of vision given proper setup.  For this description, elements will be described using this grid plus location in degrees within the specified circle, placing 0 degrees to the right and going counterclockwise, separated with the word \"mark\".))\n\n[[At the top are the instructions to view this page]]\nLook at the center with your eyes this far from the screen.\n[[A rolled-up sheet of paper that equals about 55 total horizontal degrees in width in the measurement of the chart]]\n(You can roll up a sheet of paper and cut it - or zoom the page - so it matches this image)\n\n17 mark 0: right eye blind spot. \n\nfrom 0 to 30 mark 15: [[The same image, increasing in absolute size from a very tiny object in the center to one about 20x original size at 30 degrees]]\nDetail - We only see at high resolution over a small area in the center of our vision where retinal cells are densest (the fovea).  If you stare at the center of this chart, your eyes are seeing all these panels at roughly the same level of detail.\n\n9 mark 105: Moon.\n\n7 mark 112: Supermoon. \n\nfrom 0 to 20 mark 170: [[Sets 3 partially overlapping circles in multiple locations along this path. Each set has a primary color in each circle and additive colors in the overlap areas, with color saturation decreasing sharply as the sets leave the center.]] \nColor Vision: We don't see much color outside the center of our vision - our brains keep track of what color things are and fill it in for us.\n\n17 mark 180: Left Eye Blind Spot. (not pictured: T-Boz blind spot, Chilli blind spot)\n\nfrom 0 to infinity mark from 180 to 205: [[A swath of blue, with heavier saturation up to 5 degrees from center to fading, but never gone out to the edges of the image]]\nfrom 0 to 7 from 205 to 235:[[A swath of red, with full saturation in the center and fading out completely at 7 degrees from center]]\nfrom 0 to 7 from 235 to 270:[[A swath of green, with full saturation in the center and fading out completely at 7 degrees from center]]\nRed and green-sensitive cones are mainly limited to the center of our vision.  We have few blue-sensitive cone cells, but they're found out to the edge of our vision.\n\n25 mark 205: [[A small whisp of white in a swath of blue]]\nBlue-sky sprites: These tiny, darting spots, visible against smooth blue backgrounds, are white cells moving in the blood vessels over the retina]]\n\n5 mark 195: [[a long blob, slightly distorting the blue swath]]\nFloaters: Some types of floaters are caused by breakdown of your eyeball goop as you age, but this type is some other kind of debris near the retina.  I don't know what.\n\n10 mark 270: [[An askew crosshair and circle, with faint blue and yellow wedges inside]]\nHumans can see polarization - Stare at a white area on an LCD display while rotating it or your head fast [[use straight ahead as the axis of rotation]].  Polarization direction is shown by a faint central yellow\nblue shape.  (Also visible in deep blue skies)\n\nfrom 0 to 30 mark 340: [[The same image, increasing in absolute size from a very tiny object in the center to one about 20x original size at 30 degrees. The brightness of the image varies from black at 2 mark 340, to gray at 5 mark 340, to nearly white at 10 mark 340, to slightly grayer at 20 mark 340, to medium gray at 30 mark 340.]]\nNight Vision: Cone cells (sharp, central color vision) don't work in low light, but rod cells (monochrome, low-res, non-central) do.  This is why you can walk around in dim light, but not read.  It's also why you can spot fainter stars by looking next to them.\n\n\n\n\n\n{{Title text: I recently learned something that solved a mystery that had bugged me since childhood--why, when I looked at an analog clock, the hand would sometimes seem to take a couple seconds to start ticking. Google \"stopped clock illusion\".}}", "alt": "I recently learned something that solved a mystery that had bugged me since childhood--why, when I looked at an analog clock, the hand would sometimes seem to take a couple seconds to start ticking. Google \"stopped clock illusion\".", "img": "https://imgs.xkcd.com/comics/visual_field.png", "title": "Visual Field", "day": "11"}