{"month": "11", "num": 1133, "link": "", "year": "2012", "news": "", "safe_title": "Up Goer Five", "transcript": "US Space Team's Up Goer Five\n[NASA's Saturn V]\nThe only flying space car that's taken anyone to another world.\n[The only spacecraft to take anyone somewhere other than Earth]\n(Explained using only the ten hundred [thousand] words people use the most often)\n\n((The following is a top-to-bottom description of the various parts of the Saturn V, alternating between the limited-vocabulary version and the technical version))\n\nThing to help people escape really fast if there's a problem and everything is on fire so they decide not to go to space\n[Launch Escape System]\n\nThing to control which direction the escaping people go.\n[Launch Escape System pitch motor]\n\nStuff to burn to make the box with the people in it escape *really fast*\n[Launch Escape Motor]\n\nPlace where fire comes out to help them escape.\n[Launch Escape Motor nozzles]\n\nPart that flies around the other world and comes back home with the people in it and falls in the water.\n[Apollo Command Module; includes \"People Box, Door, Chairs\"]\n\nPart that goes along to give people air, water, computers and stuff. It comes back home with them, but burns up without landing.\n[Apollo Service module]\n\nCold Air for burning (and breathing). This part had a *very* big problem once.\n[oxygen tank; was the tank that exploded during the Apollo 13 incident]\n\nPart that flies down to the other world with two people inside\n[Lunar Module]\n\nPart that stays on the other world (It's still there)\n[Lunar Module Descent Stage]\n\nFeet that go on the ground of the other world \n[Lunar Module Descent Stage landing gear]\n\nRing holding most of the computers\n[Instrument Unit]\n\nPart that falls off third (this part flew away from our world into space and hit the world we were going toward)\n[Third stage]\n\nThings holding that kind of air that makes your voice funny (It's for filling up the space left when they take the cold air out to burn it)\n[Helium tank]\n\nThe kind of air that once burned a big sky bag and people died and someone said \"Oh the [humans]!\" (used for burning) (wet and *very* cold)\n[Liquid Hydrogen tank]\n\nThe part of air you need to breathe, but not the other stuff (used for burning)(wet and *very* cold)\n[Liquid Oxygen tank]\n\nFire comes out here\n[J-2 Third stage engine]\n\nPart that falls off second\n[Second stage]\n\nMore sky bag air (for burning)(cold + wet)\n[Liquid Hydrogen tank, Second stage]\n\nMore breathing-type air (for burning)(cold + wet)\n[Liquid Oxygen tank, Second stage]\n\nThing that brings in cold wet air to burn\n[Fuel tank input, Second stage]\n\nFire comes out here\n[5 J-2 Second stage engines]\n\nPart that falls off first\n[First stage]\n\nMore breathing-type air (for burning)(cold + wet)\n[Liquid Oxygen tank, First stage]\n\nMore funny voice air (for filling up space)\n[Helium tank, First stage]\n\nOpening for putting in cold wet air\n[Liquid oxygen tank input, First stage]\n\nThis is full of that stuff they burned in lights before houses had power.  It goes together with the cold air when it's time to start going up.\n[Kerosene tank, First stage]\n\nLots of fire comes out here\n[5 F-1 First stage engines]\n\n[[Description of bottom end]]\nThis end should point toward the ground if you want to go to space. If it starts pointing toward space, you are having a bad problem and you will not go to space today.\n\n{{Title text: Another thing that is a bad problem is if you're flying toward space and the parts start to fall off your space car in the wrong order. If that happens, it means you won't go to space today, or maybe ever.}}", "alt": "Another thing that is a bad problem is if you're flying toward space and the parts start to fall off your space car in the wrong order. If that happens, it means you won't go to space today, or maybe ever.", "img": "https://imgs.xkcd.com/comics/up_goer_five.png", "title": "Up Goer Five", "day": "12"}