{"month": "11", "num": 1140, "link": "", "year": "2012", "news": "", "safe_title": "Calendar of Meaningful Dates", "transcript": "Calendar of Meaningful Dates\n\nEach date's size represents how often it is referred to by name (e.g. \"October 17th\") in English-language books since 2000 (source: Google n-grams corpus)\n\n[[A 3x4 grid of months, laid out left to right, top to bottom from January to December. The days of each month are arranged in typical monthly calendar format. Some day numbers are larger than others.))\n\n((Due to the 365 different days in a year and individually varying sizes, not every number is mentioned below, only outliers.\n\nJanuary's 1 is much larger than any other number for that month.\nFeburary's numbers don't very all that much, but the 1, 14, and 28 are slightly larger, and the 29 is very small.\nMarch's 1 and 21 are larger than most of the other numbers.\nApril's 1 and 15 are somewhat larger than the rest.\nMay's 1 is significantly larger than any other day in the month.\nJune's 1 is significantly larger than most of the other days, but 30 is the 2nd largest.\nJuly's 1 is fairly large, but its 4 is even bigger - about twice the size of most other day's numbers.\nAugust's 1 and 15 are both fairly large.\nSeptember's 1 is somewhat large, but its 11 is by far the biggest number of any in the entire year, 3 times as tall as most other numbers from any month.\nOctober's 1 is its largest, followed by the 31.\nNovember's 1 is by far its largest.\nDecember's 31 is the largest, followed by its 1, 7, and 25.))\n\n\n{{Title text: In months other than September, the 11th is mentioned substantially less often than any other date. It's been that way since long before 9\n11 and I have no idea why.}}", "alt": "In months other than September, the 11th is mentioned substantially less often than any other date. It's been that way since long before 9/11 and I have no idea why.", "img": "https://imgs.xkcd.com/comics/calendar_of_meaningful_dates.png", "title": "Calendar of Meaningful Dates", "day": "28"}