{"month": "11", "num": 1141, "link": "", "year": "2012", "news": "", "safe_title": "Two Years", "transcript": "[[A man and a woman sit on a bed, the woman is talking on the phone. The person she is talking to, a doctor holding a clipboard, is shown inset.]]\nWoman: Oh god.\n\n[[The man and woman sit together while the woman, now bald, is receiving chemotherapy. They are both on their laptops.]] \n<< ... BEEEP ... BEEEP ... BEEEP ... >>\n\n[[The man and the woman (who is wearing a knit cap) are paddling a kayak against a scenic mountain backdrop.]]\n\n[[The man and woman sit at a table, staring at a cell phone. There is a clock on the wall.]]\nWoman: How long can it take to read a scan?\n\n[[The man and woman are back at the hospital again, the woman receiving chemo. They are playing Scrabble.]]\nMan: \"ZARG\" isn't a word.\nWoman: But \nCAAAANCER.\n\nMan: ...ok, fine.\n\n[[The man and woman are listening to a friend speak.]\nFriend: So next year you should come visit us in the moun... (the rest is obscured by a thought bubble).\nMan & Woman: (thinking) \"Next Year\"\n\n[[The man and the woman (with short hair) getting married, a heart above their heads.]]\n\n[[The man and the woman (wearing a knit cap) stand on a beach, watching a whale breach.]]\n<<FWOOSH>>\n\n[[The woman is sitting at a desk with several books and a laptop. The man stands behind her.]]\nMan: Hey - you're doing science, and you're still alive.\nWoman: Yeah!\n\n[[The man and woman sit under a tall tree on a hill.]]\nMan: It's really only been two years?\nWoman: They were big years.\n\n[[The man and woman sit at a table in a fancy restaurant, the waiter brings them a dish with a cover on it.]]\nWaiter: Happy.. anniversary?\nWoman: Biopsy-versary!\nWaiter: ...eww.\n \n\n{{Title text: She won the first half of all our chemo Scrabble games, but then her IV drugs started kicking in and I *dominated*.}}", "alt": "She won the first half of all our chemo Scrabble games, but then her IV drugs started kicking in and I *dominated*.", "img": "https://imgs.xkcd.com/comics/two_years.png", "title": "Two Years", "day": "30"}