{"month": "4", "num": 1193, "link": "", "year": "2013", "news": "", "safe_title": "Externalities", "transcript": "((This is a dynamic image with several different mouse-overs. Mouse-overs for specific panels are included in double curly brackets.))\n\nAhoy, Carnegie Melonites! Come find your future at Baidu.\n[[A woman with black hair stands in a blank void.]]\nWoman: But nothing about Tiananmen Square.\n{{Happy April 1st, everyone!}}\n((There is a link on this panel to almamater.xkcd.com.))\n\nIt takes great minds to stifle other great minds.\n[[A woman with a ponytail sits at a desk with two other people.]]\nWoman: Let's block Canada\nOthers: Sounds good.\n\nWe're a convenient four hour drive from New York City (15,000 hours by Roomba)\n[[A woman crouches on a moving Roomba with a steaming mug of coffee in one hand and a smartphone in the other.]]\n<<whirrrrrrr>>\n\nOur recruiters are on the hunt for unaware CMU graduates\n[[A dark-haired woman approaches three students with a giant net as they leave a classroom.]]\n\nOr UIC graduates, provied any of them manage to fill out the application correctly.\n[[A website application which reads:]]\nName: WHICH ONE\nEmail: FORGET IT\nEducation: RIDING THE L ALL NIGHT LONG\n((uic has the third best hash. See the full standings at http:\n\nalmamater.xkcd.com\nbest.csv))\n\nAt Baidu, Inc., you'll have the opportunity to work on cutting-edge projects.\n[[A man sits at a computer.]]\nMan: What does \"make dog\" do?\nOff-screen person: Experimental dog generator. Don't click on it; the default size isn't set, so-\n<<click>>\n\n[[The man stares at the screen.]]\n<<KZZZT>> <<*bip*>>\nOff-screen: Uh oh.\n\n[[A giant dog licks the desk where the computer once was, the man in the chair stares up at it.]]\n((The dog gains a pound for every $10 donated to the Wikimedia Foundation via this link. Currently at $41457.11.))\n\n[[A graphic showing two sliders and a dog. Next to the dog with arrows pointing to it are a thermometer graphic and the equation d(x)=R.]]\nCAREERS@BAIDU, INC.\nPLAY GOD WITH DOGS (TM) \n((There are arrows over and under \"GOD\" and \"DOG\" indicating that you switch the letters.))\n((The previous three panels link to the special Wikimedia fundraiser page.))\n\n{{Title text: Mouse over words and things to see where they come from.}}", "alt": "", "img": "https://imgs.xkcd.com/comics/externalities.png", "title": "Externalities", "extra_parts": {"pre": "", "headerextra": "\n  <style type=\"text/css\">\n    #comic {\n      width: 780px;\n      text-align: center;\n      font-family: 'xkcd-Regular';\n      font-variant: normal;\n      color: #242424;\n      position: relative;\n    }\n    #comic .panel img { position: static; }\n  </style>\n", "post": "\n<script type=\"text/javascript\" src=\"/s/ae49e5.js\"></script>\n<script type=\"text/javascript\" src=\"/s/ead7fa.js\"></script>\n", "imgAttr": ""}, "day": "1"}