{"month": "6", "num": 1227, "link": "", "year": "2013", "news": "", "safe_title": "The Pace of Modern Life", "transcript": "((This strip is in the form of a long series of quotes. Here, each quote is given as a separate panel. Attribution is delimited with a --. Some text is bolded; it is enclosed in asterisks.))\n*The art of letter-writing is fast dying out.* When a letter cost nine pence, it seemed but fair to try to make it worth nine pence... Now, however, we think we are too busy for such old-fashioned correspondence. *We fire off a multitude of rapid and short notes, instead of sitting down to have a good talk over a real sheet of paper.*\n-- The Sunday Magazine\n1871\n\nIt is, unfortunately, one of the chief characteristics of modern business to be always in a hurry. *In olden times it was different.*\n-- The Medical Record\n1884\n\nWith the advent of cheap newspapers and superior means of locomotion... the dreamy quiet old days are over... for *men now live think and work at express speed.* They have their \nMercury\n or \nPost\n laid on their breakfast table in the early morning, and if they are too hurried to snatch from it the news during that meal, they carry it off, to be *sulkily read as they travel... leaving them no time to talk with the friend who may share the compartment with them*... the hurry and bustle of modern life... lacks the quiet and repose of the period when our forefathers, the day's work done, took their ease...\n-- William Smith, Morley: Ancient and Modern\n1886\n\nConversation is said to be a lost art... good talk presupposes leisure, both for preparation and enjoyment. *The age of leisure is dead, and the art of conversation is dying.*\n-- Frank Leslie's Popular Monthly, volume 29\n1890\n\nIntellectual laziness and the hurry of the age have produced *a craving for literary nips*. The torpid brain... has grown too weak for sustained thought. \n*There never was an age in which so many people were able to write badly*. \n-- Israel Zangwill, The Bachelors' Club\n1891\n\n*The art of pure line engraving is dying out. We live at too fast a rate* to allow for the preparation of such plates as our fathers appreciated. If a picture catches the public fancy, the public must have an etched or a photogravured copy of it within a month or two of its appearance. The days when engravers were wont to spend two or three years over a single plate are for ever gone. \n-- Journal of the Institute of Jamaica, volume 1\n1892\n\nSo much is exhibited to the eye that *nothing is left to the imagination*. It seems almost possible that the modern world might be choked by its own riches, *and human faculty dwindle away amid the million inventions that ahve been introduced to render its exercise unnecessary*.\nThe articles in the quarterlies extend to thirty or more pages, but *thirty pages is now too much*. So we witness a further condensing process and, we have the \nfortnightly\n and the \ncontemporary\n which reduce thirty pages to *fifteen pages* so that you may read a larger number of articles in a shorter time and in a shorter form. As if this last condensing process were not enough the condensed articles of these periodicals are *further condensed* by the daily papers, which will give you *a summary of the summary* of that which has been written about everything. \n*Those who are dipping into so many subjects and gathering information in a summary and superficial form lose the habit of settling down to great works*. \nEphemeral literature is driving out the great classics of the present and the past... *hurried reading can never be good reading*. \n-- G. J. Goschen, First annual address to the students, Toynbee Hall, London\n1894\n\nThe existence of *mental and nervous degeneration among a growing class of people*, especially in large cities, is an obvious phenomenon... the mania for stimulants... diseases of the mind are almost as numerous as the diseases of the body... this intellectual condition is characterized by *a brain incapable of normal working... in a large measure due to the hurry and excitement of modern life*. with its facilities for rapid locomotion and almost instantaneous communication between remote points of the globe*...\n-- The Churchman, volume 71\n1895\n\nIf we *teach the children how to play* and encourage them in their sports... *instead of shutting them in badly ventilated schoolrooms*, the next generation will be more joyous and will be heailthier than the present one. \n-- Public Opinion: A Comprehensive Summary of the Press Throughout the World, volume 18\n1895\n\nThe cuase of the... increase in nervous disease is *increased demand made by the coditions of modern life upon the brain*. Everything is done in a hurry. *We talk across a continent, telegraph across an ocean*, take a trip to Chicago for an hour's talk... *We even take our pleasures sadly and make a task of our play*... What wonder if the pressure is almost more than our nerves can bear. \n-- G. Shrady (from P. C. Knapp) \"Are nervous diseases increasing?\" Medical Record\n1896\n\n*The managers of sensational newspapers*... do not try to educate their readers and make them better, but tend to *create perverted tastes and develop vicious tendencies*. The owners of these papers seem to have but one purpose, and that is to increase their circulation.\n-- Medical Brief, volume 26\n1898\n\n*To take sufficient time for our meals seems frequently impossible* on account of the demands on our time made by our business... we act on the apparent belief that all of our business is so pressing that we must jump on the quickest car home, eat our dinner in the most hurried way, make the closest connection for car returning... \n-- Louis John Rettger, Studies in Advanced Physiology\n1898\n\nIn these days of increasing rapid artificial locomotion, *may I be permitted to say a word in favour of a very worthy and valuable old friend of mine, Mr Long Walk?*\n*I am afraid that this good gentleman is in danger of getting neglected, if not forgotten*. We live in days of water trips and land trips, excursions by sea, road and rail- bicycles and tricycles, tram cars and motor cars... but in my humble opinion, good honest walking exercise for health beats all other kinds of locomotion into a cocked hat. \n-- T. Thatcher, \"A plea for a long walk\", The Publishers' Circular\n1902\n\nThe art of conversation is almost a lost one. *People talk as they ride bicycles - at a rush - without pausing to consider their surroundings*... What has been generally understood as cultured society is rapidly deteriorating into baseness and voluntary ignorance. *The profession of letters is so little understood*, and so far from being seriously appreciated, that... newspapers are full, not of thoughtful honestly expressed public opinion on the affairs of the nation, but of vapid personalities interesting to none save gossips and busy bodies. \n-- Marie Corelli, Free Opinions, Freely Expressed\n1905\n\nThere is a great *tendency among the children of today to rebel against restraint*, not only that placed upon them by the will of the parent, but against any restraint or limitation of what they consider their rights... this fact has filled well minded people with great apprehensions for the future. \n-- Rev. Henry Hussmann, The Authority of Parents\n1906\n\n*Our modern family gathering, silent* around the fire, *each individual with his head buried in his favourite magazine*, is the somewhat natural outcome of the banishment of colloquy from the school...\n-- The Journal of Education, volume 29\n1907\n\nPlays in theatres at the present time present spectacles and *deal openly with situations which no person would have dared to mention in general society forty years ago*... The current representations of *nude men and women in the daily journals* and the illustrated magazines would have excluded such periodicals from all respectable families two decades ago... Those who have been divorced... forty and fifty years ago lost at once and irrevocably their standing in society, while to-day they continue in all their social relationships, hardly changed...\n-- Editorial, The Watchman, Boston\n1908\n\nWe write millions more letters than did our grandfathers, but the increase in volume has brought with it an automatic artificial machine-like ring... an examination of a file of old letters reveals not only a remarkable grasp of details, but a *fitness and courtliness too often totally lacking* in the mechanical curt cut and dried letters of to-day. \n-- Forrest Crissey, Handbook of Modern Business Correspondence\n1908\n\n*A hundred years ago it took so long and cost so much to send a latter that it seemed worth while to put some time and thought into writing it*. Now the quickness and the cheapness of the post seem to justify the feeling that *a brief letter to-day may be followed by another next week - a \"line\" now by another to-morrow*. \n-- Percy Holmes Boynton, Principles of Composition \n1915\n\n{{Title text: 'Unfortunately, the notion of marriage which prevails ... at the present time ... regards the institution as simply a convenient arrangement or formal contract ... This disregard of the sanctity of marriage and contempt for its restrictions is one of the most alarming tendencies of the present age.' --John Harvey Kellogg, Ladies' guide in health and disease (1883)}}", "alt": "'Unfortunately, the notion of marriage which prevails ... at the present time ... regards the institution as simply a convenient arrangement or formal contract ... This disregard of the sanctity of marriage and contempt for its restrictions is one of the most alarming tendencies of the present age.' --John Harvey Kellogg, Ladies' guide in health and disease (1883)", "img": "https://imgs.xkcd.com/comics/the_pace_of_modern_life.png", "title": "The Pace of Modern Life", "day": "19"}