{"month": "8", "num": 1246, "link": "", "year": "2013", "news": "", "safe_title": "Pale Blue Dot", "transcript": "[[A figure stands in front of a projector screen with a pointer. He is, presumably, addressing a room of his peers off-panel.]]\nLecturer: Consider this pale blue dot. That's here. That's home. That's us. Everyone you love, every human being who ever was, every saint and sinner in the history of our species lived out their lives on this mote of dust suspended in a sunbeam. All our-\nPeer 1: I think that's a stuck pixel. We're the speck on the left. \nLecturer: ... OK, *this* pale blue dot is everything you-\nPeer 2: -No, you were right before. *That* one is Earth.\nLecturer: LOOK, IT DOESN'T MATTER! \nPeer 3: I *knew* it! \nPeer 4: I think this is just a lens cap picture. \n\n{{Title text: Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves. There is no road out of this oblivion; we must embrace it. We must join with the darkness. Ba'al the Annihilator offers us no happiness, no answers, naught but the cold embrace of the void. To imagine any other end is delusion. We must give in to the will of Ba'al, for he will one day consume us and our world alike. I therefore call on Congress to fully fund space exploration, and to join with Ba'al, the Eater of Souls. Thank you.}}", "alt": "Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves. There is no road out of this oblivion; we must embrace it. We must join with the darkness. Ba'al the Annihilator offers us no happiness, no answers, naught but the cold embrace of the void. To imagine any other end is delusion. We must give in to the will of Ba'al, for he will one day consume us and our world alike. I therefore call on Congress to fully fund space exploration, and to join with Ba'al, the Eater of Souls. Thank you.", "img": "https://imgs.xkcd.com/comics/pale_blue_dot.png", "title": "Pale Blue Dot", "day": "2"}