{"month": "10", "num": 1276, "link": "", "year": "2013", "news": "", "safe_title": "Angular Size", "transcript": "The size of the part of Earth's surface directly under various space objects\n\n[[A diagram showing the 2D projection of objects from space onto the Earth's surface, by drawing lines from the center of the Earth to the edges of those objects as seen from Earth, and looking at where that intersects with the Earth's surface.]]\n\n[[An overlay of a darkened circle on a map, with the circle approximately overlapping the M25 freeway around London, labeled \"The sun and the moon, (about the same size)\"]]\n\n[[A series of circles of increasing size, with the smallest approximately the same size as the size of a soccer field drawn for comparison. In increasing order, they are Neptune, Uranus, Mercury, Saturn, Mars, and Jupiter.]]\n\n[[The same soccer field is now much larger, filling the next frame, with other circles overlaid on top of it. The one labeled Ganymede is approximately 90% of the soccer field's shorter axis, and then in decreasing order from there are Callisto, Io, Europa, Titan, Ceres, Triton, and then Pluto.]]\n\n[[The next frame shows a ping pong table. Slightly larger than the ping pong table are the circles for Phobos and R. Doradus. Deimos has almost exactly the same size as the shorter axis of the table, followed by Betelgeuse and Eris.]]\n\n[[A laptop computer is shown. Approximately the same size as the laptop is the circle for 4942 Munroe. Smaller than that are Alpha Centauri A, Sirius, Alpha Centauri B, Proxima Centauri, and Barnard's Star.]]\n\n[[The background of this frame is a tilde character, labeled \"Tilde on a laptop keyboard. Approximately the same width of the tilde is the circle for HD 189773 b (permadeath), followed by Tau Ceti C (giant dog planet), Gliese 667Cc (pilf), Gliese 581 g (jelly-filled planet), HD 20794 c (moonchild), a circle approximately the same width as the tilde's stroke labeled \"event horizon of the black hole at the center of our galaxy\", and a very small circle labeled KOI-1686.01 (emergency backup earth).]]\n\n[[An E.coli bacterium is in the background of this frame. Silhouettes of the Voyager 1 and Voyager 2 satellites are approximately the same size as the bacterium.]]\n\n{{Title text: If the celestial sphere were mapped to the Earth's surface, astronomy would get a LOT easier; you'd just need a magnifying glass.}}", "alt": "If the celestial sphere were mapped to the Earth's surface, astronomy would get a LOT easier; you'd just need a magnifying glass.", "img": "https://imgs.xkcd.com/comics/angular_size.png", "title": "Angular Size", "day": "11"}