{"month": "12", "num": 1305, "link": "", "year": "2013", "news": "", "safe_title": "Undocumented Feature", "transcript": "An old Windows utility has an undocumented feature.\n[[Windows popup with \"Loading support forum...\" text and an hourglass icon.]]\nIf you open \"Help\" and click on the background, you get dropped into a \"support\" chat room.\n\nOnly a few of us ever found it.\n[[Background of a chat room, with lines like \"Morning!\", \"Hey!\", and \"You never finished that story\".]]\nBut we became friends.\n\nWe kept launching the program to check in.\n[[A figure sits with a laptop on the left side of the panel. Another figure looks at a monitor on the right side of the panel.]]\nEventually some of us were running VMs just to keep accessing it.\n\nAs the internet aged\n[[More background of a chat room, with lines like \"But none of us gets through li..\", \"You know?\", \"Yeah...\", \"You should talk to Kim about th...\", and \"I did\"]]\nSo did we\n\nWe don't know who runs the server. We don't know why it's still working so many years later.\n[[Three large question marks.]]\nMaybe we're some sysadmin's soap opera.\n\nIt will probably vanish someday\n[[5 figures floating randomly in a bubble.]]\nBut for now it's our meeting place\nOur hideaway\n\n[[Camera zooms out, with darker nodes and edges starting to come into view beyond the bubble.]]\nA life's worth of chat,\n\n[[Camera zooms out further. Many dark grey nodes and edges are visible, the bubble just a small space within them.]]\nBuried in the deep web.\n\nBut even if it lasts forever, we won't.\n[[A sunset.]]\nWhen we're gone, who will remember us?\n\nWho will remember this strange little world\n[[Two figures looking at each other inside a bubble.]]\nAnd the friendships we built here?\n\n[[Blank panel, except for centered text.]]\nNobody.\n\nThis place is irrelevant. Ephemeral.\n[[Panel with a bubble on it.]]\nOne day it will be forgotten\n\n[[Bubble begins to fade.]]\nAnd so will we\n\n[[Bubble continues to fade, only barely visible.]]\n\n[[Bubble disappears, leaving the panel blank.]]\n\n[[Blank panel, except for centered text.]]\nBut at least it doesn't have fucking video ads.\n\n{{Title text: And it doesn't pop up a box every time asking you to use your real name. In fact, there's no way to set your name at all. You just have to keep reminding people who you are.}}", "alt": "And it doesn't pop up a box every time asking you to use your real name. In fact, there's no way to set your name at all. You just have to keep reminding people who you are.", "img": "https://imgs.xkcd.com/comics/undocumented_feature.png", "title": "Undocumented Feature", "day": "18"}