{"month": "1", "num": 1311, "link": "", "year": "2014", "news": "", "safe_title": "2014", "transcript": "((This is a series of quotes from various people of various timeframes.  The sections surrounded by two dashes (--) are bolded.  Each quote is followed by the author, the document of publication if applicable, and the year))\n\nIt is desirable -every thing printed should be preserved,- for we -cannot now tell how useful it may become- two centuries hence.\nChristopher Baldwin\n1834\n\nI predict that a century hence the -Canadian People- will be -the noblest specimens of humanity on the face of the Earth-\nRev. John Bredin\n1863\n\nIn the twenty-first century -mankind will subsist entirely upon jellies.- \nThe Book Lover\n1903\n\nThe twenty-first century baby is destined to be rocked and cradled by electricity, warmed and coddled by electricity, perhaps fathered and mothered by electricity.  -Probably the only thing he will be left to do unaided will be to make love-\nMrs. John Lane, The Fortnightly\n1905\n\nTo-day, in the city of New York, sixty-six different tongues are spoken. -A century hence, there will probably only be one-\nThe American Historical Magazine\n1907\n\nI often think -what interesting history we are making for the student of the twenty-first century-\nWilliam Carey Jones\n1908\n\nChina may be a -great shoe market- a decade or a century from now\nBoot and Shoe Recorder\n1914\n\nBy the twenty-first century I believe -we shall all be telepaths.-\nGumbriel, Character in Antic Hay\n1923\n\nThe physician of the twenty-first century...  May even criticize the language of the times, and may find that -some of our words have become as offensive to him as the term \"lunatic\" has become offensive to us.-\nDr. C. Macfie Cambpbell\n1924\n\nHistorians of the twenty-first century will look back with well-placed scorn on the -shallow-minded days- of the early twentieth century -when football games and petting parties were considered the most important elements of a college education.-\nMary Eileen Ahern, Library Bureau\n1926\n\n-In the year A.D. 2014- journalists will be writing on the centenary of the Great War-- -That is, if there has not been a Greater War-\nF.J.M, The Journalist\n1934\n\n{{Title text: Some future reader, who may see the term, without knowing the history of it, may imagine that it had reference to some antiquated bridge of the immortal Poet, thrown across the silver Avon, to facilitate his escape after some marauding excursion in a neighbouring park; and in some Gentleman's Magazine of the next century, it is not impossible, but that future antiquaries may occupy page after page in discussing so interesting a matter. We think it right, therefore, to put it on record in the Oriental Herald that the 'Shakesperian Rope Bridges' are of much less classic origin; that Mr Colin Shakespear, who, besides his dignity as Postmaster, now signs himself 'Superintendent General of Shakesperian Rope Bridges', is a person of much less genius than the Bard of Avon. --The Oriental Herald, 1825}}", "alt": "Some future reader, who may see the term, without knowing the history of it, may imagine that it had reference to some antiquated bridge of the immortal Poet, thrown across the silver Avon, to facilitate his escape after some marauding excursion in a neighbouring park; and in some Gentleman's Magazine of the next century, it is not impossible, but that future antiquaries may occupy page after page in discussing so interesting a matter. We think it right, therefore, to put it on record in the Oriental Herald that the 'Shakesperian Rope Bridges' are of much less classic origin; that Mr Colin Shakespear, who, besides his dignity as Postmaster, now signs himself 'Superintendent General of Shakesperian Rope Bridges', is a person of much less genius than the Bard of Avon. --The Oriental Herald, 1825", "img": "https://imgs.xkcd.com/comics/2014.png", "title": "2014", "day": "1"}