{"month": "3", "num": 1337, "link": "", "year": "2014", "news": "", "safe_title": "Hack", "transcript": "[[A white-on-black drawing of the ISEE-3\nICE probe.]]\nThe ISEE-3\nICE probe was launched in 1978. Its mission ended in 1997 and it was sent a shutdown signal.\n\n[[Back to black-on-white text.]]\nIn 2008, we learned--to our surprise--that the probe didn't shut down. It's still running and it has plenty of fuel. ...and in 2014, its orbit brings it near Earth.\n\n[[Two figures talking.]]\nFigure 1: We could sent it on a new mission... except we no longer have the equipment to send commands to it.\nFigure 2: Can't we-\n\n[[Camera frame closes in slightly on the first figure.]]\nFigure 1: NASA won't rebuild it. \"Too expensive.\"\nFigure 2: Seriously?\nFigure 2: I know, right? So the internet found the specs and we went to work.\n\n[[Camera zooms out as the two figures walk through an area with two other figures seated at desks working on laptops; one of the seated figures is wearing a headset.]]\nFigure 1: We've convinced them to give us time on the Madrid DSN transmitter and hacked the maser to support the uplink. And today's the big day.\n\n[[Camera focuses on the figure with the headset.]]\nHeadset Operator 1: Transmitting... We have a signal! We have control!\n\n[[Camera flips back to the first figure.]]\nFigure 1: Okay, transmit the new comet rendezvous maneuver sequen-\nOff screen: What the hell?\n\n[[Camera zooms back out to show all four figures.]]\nHeadset Operator 1: My console went dead!\nOperator 2: Mine too!\nFigure 1: What's happening?\n\n[[Camera back to figure with headset, staring at screen.]]\nHeadset Operator 1: There's a new signal going out over the transmitter!\nFigure 1 (from offscreen): A bug?\nHeadset Operator 1: Someone else is in the system!\n\n[[Camera switches to the second operator.]]\nOperator 2: Kill the connection!\nHeadset Operator 1 (from offscreen): I can't find it!\nOperator 2: They're firing the probe's engines!\nHeadset Operator 1 (from offscreen): No!!\n\n[[Camera switches back to the headset operator.]]\nFigure 1 (from offscreen): Who's doing this?? Stop them!\nOperator 2 (from offscreen): I'm trying!\nHeadset Operator 1: Look! My screen!\n\n[[The camera zooms back to show all of them, and a message is being shown on the headset operator's screen, in red.]]\nM-E-S-S-W-I-T-H-T-H-E-B-E-S-T\nD-I-E-L-I-K-E-T-H-E-R-E-S-T\n\n[[Camera cuts to a pool with two figures in it.]]\n\n[[Camera zooms out to show that the pool is on the roof of a downtown building. We see the figures' speech coming from it.]]\nBurn: Crash?\nCrash: Yeah, Burn?\n\n[[Same skyline view.]]\nBurn: Make a wish.\n\n[[A meteor passes through the sky above the city skyline.]]\n\n{{Title text: HACK THE STARS}}", "alt": "HACK THE STARS", "img": "https://imgs.xkcd.com/comics/hack.png", "title": "Hack", "day": "3"}