{"month": "7", "num": 135, "link": "", "year": "2006", "news": "", "safe_title": "Substitute", "transcript": "[[In a class room, the board says \"Math\" on the top-left corner, and \"Mr. Munroe\" in the middle. A stick figure is standing in front of it, speaking to the class.]]\nTeacher: Miss Lenhart couldn't be here today, so she asked me to substitute.\nTeacher: I've put out your test. Please get started.\n[[A student in the first row raises the exam paper and says.]]\nStudent: Mr. Munroe, Miss Lenhardt never taught us this.\nTeacher: That's because Miss Lenhart doesn't understand how important certain kinds of math are.\nStudent: But this just looks --\nTeacher: This material is more vital than anything you've ever learned\nStudent: But --\nTeacher: No buts.\nTeacher: This is a matter of life and death.\n[[Excerpt from the exam paper.]]\nName: _________\n[[A stick figure is standing, hands over head. A velociraptor is running towards it.]]\n1. The velociraptor spots you 40 meters away and attacks, accelerateing at 4 m\ns^2 to its top speed of 25 m\ns. When it spots you, you begin to flee, quickly reaching yourtop speed of 6 m\ns. How far can you get before you're caught and devoured?\n2. You're at the center of a 20m equilateral triangle with a raptor at each corner. The top raptor has a wounded leg and is limited to a top speed of 10 m\ns.\n[[A stick figure is shown in the above situation. The picture has a legend \"(Not to scale)\".]]\nThe raptors will run toward you. At what angle should you run to maximize the time you stay alive?\n3. Raptors can open doors, but they are slowed by them. Using the floor plan on the next page, plot a route through the building, assuming raptors take 5 minutes to open the first door and halve the time for each subsequent door. Remember, raptors run at 10 m\ns and they do not know fear.\n{{alt text: YOU THINK THIS IS FUNNY?}}", "alt": "YOU THINK THIS IS FUNNY?", "img": "https://imgs.xkcd.com/comics/substitute.png", "title": "Substitute", "day": "31"}