{"month": "5", "num": 1363, "link": "", "year": "2014", "news": "", "safe_title": "xkcd Phone", "transcript": "[[Ad for a phone, with several factoids positioned around a picture of the device]]\n\n((factoids listed here starting clockwise from the top))\n\n-Runs custom blend of Android and iOS\n-Simulates alternative speed of light (default: 100 miles per hour) and adjusts clock as phone accelerates\n-Wireless\n-Accelerometer detects when phone is in freefall and makes it scream\n-When exposed to light, phone says \"hi!\"\n-FlightAware partnership: makes airplane noise when flights pass overhead\n-Realistic case\n-Clear screen\n-Side-facing camera\n\nIntroducing the XKCD Phone -- Your mobile world just went digital® \n\n{{Title text: Presented in partnership with Qualcomm, Craigslist, Whirlpool, Hostess, LifeStyles, and the US Chamber of Commerce. Manufactured on equipment which also processes peanuts. Price includes 2-year Knicks contract. Phone may extinguish nearby birthday candles. If phone ships with Siri, return immediately; do not speak to her and ignore any instructions she gives. Do not remove lead casing. Phone may attract\ntrap insects; this is normal. Volume adjustable (requires root). If you experience sudden tingling, nausea, or vomiting, perform a factory reset immediately. Do not submerge in water; phone will drown. Exterior may be frictionless. Prolonged use can cause mood swings, short-term memory loss, and seizures. Avert eyes while replacing battery. Under certain circumstances, wireless transmitter may control God.}}", "alt": "Presented in partnership with Qualcomm, Craigslist, Whirlpool, Hostess, LifeStyles, and the US Chamber of Commerce. Manufactured on equipment which also processes peanuts. Price includes 2-year Knicks contract. Phone may extinguish nearby birthday candles. If phone ships with Siri, return immediately; do not speak to her and ignore any instructions she gives. Do not remove lead casing. Phone may attract/trap insects; this is normal. Volume adjustable (requires root). If you experience sudden tingling, nausea, or vomiting, perform a factory reset immediately. Do not submerge in water; phone will drown. Exterior may be frictionless. Prolonged use can cause mood swings, short-term memory loss, and seizures. Avert eyes while replacing battery. Under certain circumstances, wireless transmitter may control God.", "img": "https://imgs.xkcd.com/comics/xkcd_phone.png", "title": "xkcd Phone", "day": "2"}