{"month": "8", "num": 141, "link": "", "year": "2006", "news": "", "safe_title": "Parody Week: Achewood", "transcript": "[[Philippe is dreaming of having his ears checked. There's an eye chart on the wall behind him.]]\nDoctor (out of frame): Philippe, your hearing is perfect! In fact, you heard ALL the beeps! You have super-hearing! You're needed at Hogwarts!\nPhilippe: Oh boy!\n[[Ray is holding a letter and talking to Roast Beef.]]\n{{Meanwhile . . .}}\nRay: Beef, check this out. I got an invite to that The Dude Is Pretty Awesome In Most Measurable Ways I Mean Wow competition.\nBeef: Alright that is pretty sweet dogg what is your strategy gonna consist of\nRay: I'm thinkin' I need to point out my best features--maybe go holdin' a sign with an arrow toward my junk.\n[[Ray holds up a sign saying \"Yes\" such that the an arrow on it points directly at his crotch.]]\nBeef: Yeah well I always said subtlety was your middle name dogg\nBeef: And also your first and last in case they didn't get the point\nRay: How do you think I should play it?\nBeef: Well basically you got no chance as I see it these dudes are all lovers and fighters to the last\nBeef: All sprung fully formed from the head of Sweet Sweetback\nBeef: You are gonna stand out as the sort of dude who stays at home all night playing fleshlight tag\nRay: These words you got are crazy. Didn't I win the outdoor fight?\nBeef: Uh huh about the fight I wasn't gonna tell you but how could you miss that I was setting you up\nRay: What?\nBeef: You got played dogg\nBeef: I basically just didn't have the heart to go through with it in the end.\nBeef: Anyway the point is that you are gonna lose this thing so hard\nBeef: All cheap McD's hamburger to their slabs of steak\nBeef: A couple 12-oz sirloins garnished with nothing but pure manhood\nBeef: Maybe some sprigs of parsley\nBeef: You are pretty much going down\n[[Closeup of a shocked Ray.]]\n[[Silence.]]\n[[Silence. Beef looks perturbed and his ear is twitching. Ray's mouth is open.]]\n[[Silence. Beef looks sorry.]]\n[[Silence. Beef looks sorry and Ray looks annoyed.]]\n[[Silence.]]\n[[Silence.]]\n[[Silence. Beef is looking down and Ray's mouth is open.]]\n[[Silence. Ray's mouth is open.]]\n[[Silence. Beef is looking down and Ray's mouth is open.]]\n[[Silence. Beef looks surprised.]]\n{{alt: I always wanted to impress them with how well I could hear, didn't you? Also, this sets the record for number of awkward-pause panels in one strip (previously held by Achewood)]]", "alt": "I always wanted to impress them with how well I could hear, didn't you?  Also, this sets the record for number of awkward-pause panels in one strip (previously held by Achewood)", "img": "https://imgs.xkcd.com/comics/achewood.png", "title": "Parody Week: Achewood", "day": "14"}