{"month": "8", "num": 1414, "link": "", "year": "2014", "news": "", "safe_title": "Writing Skills", "transcript": "[[White Hat Guy and another guy are walking along. WHG is reading an article.]]\nWHG: Weird - another study found that kids who use SMS abbreviations actually score \nhigher\n on grammar and spelling tests.\nOther guy: Why on \nearth\n is that a surprise?\n\n[[Other guy expounds while an inset panel shows various kids throwing and catching balls while doing such things as walking the dog and eating lunch.]]\nOG: Imagine kids start playing catch literally \nall the time\n. Everywhere they go, they throw balls back and forth, toss them in the air, and hurl them at trees and signs - nearly every waking hour of their lives.\n\n[[WHG starts to walk away.]]\nOG:Do you think their generation will suck at baseball because they learned sloppy skills?\nWHG: ...so you think someone will become a great writer while \nsexting\n?\n\n[[They both walk together.]]\nOG: Have you \nread\n James Joyce's love letters? The phrases \"my little fuckbird\" and \"arse full of farts\" appear. If we want to write \nUlysses\n, our generation may not be sexting \nenough\n. \nWHG: Eww.\n\n{{Title text: I'd like to find a corpus of writing from children in a non-self-selected sample (e.g. handwritten letters to the president from everyone in the same teacher's 7th grade class every year)--and score the kids today versus the kids 20 years ago on various objective measures of writing quality. I've heard the idea that exposure to all this amateur peer practice is hurting us, but I'd bet on the generation that conducts the bulk of their social lives via the written word over the generation that occasionally wrote book reports and letters to grandma once a year, any day.}}", "alt": "I'd like to find a corpus of writing from children in a non-self-selected sample (e.g. handwritten letters to the president from everyone in the same teacher's 7th grade class every year)--and score the kids today versus the kids 20 years ago on various objective measures of writing quality. I've heard the idea that exposure to all this amateur peer practice is hurting us, but I'd bet on the generation that conducts the bulk of their social lives via the written word over the generation that occasionally wrote book reports and letters to grandma once a year, any day.", "img": "https://imgs.xkcd.com/comics/writing_skills.png", "title": "Writing Skills", "day": "29"}