{"month": "9", "num": 1416, "link": "", "year": "2014", "news": "", "safe_title": "Pixels", "transcript": "[[A large picture of a person kneeling on the ground, stacking turtles.]]\n((In this strip, when you zoom into the panel, each pixel becomes its own panel. Each of those panels can be scrolled into, for the same effect. The story progresses as you scroll deeper.))\n[[The Earth as seen from space with the words BOOK LAUNCH.]]\n[[A stick-Randall holding a copy of 'What If?' saying, \"So excited about my book launch!\"]]\n[[A copy of the cover of 'What If?' labeled \"book.\"]]\n[[Stick-Randall is assembling parts from a box labeled 'rocket parts' and preparing to 'launch' his book.]]\n[[Various stages of assembly.]]\n[[A second person comes in, looks at SR's rocket set-up and says, \"Needs more struts.\"]]\n[[SR adds more struts.]]\n[[The rocket launches.]]\n[[A big cloud of smoke, which then dissipates.]]\n[[SR and the other person look skywards at the launched book.]]\n[[The book is shown leaving Earth's orbit.]]\n[[The other person turns to SR and says, \"I think that was the only one.\"]]\n[[The two walk away.]]\n((The panels after this are a random assortment of these mostly stand-alone panels.))\n[[A momma duck with several ducklings in a row behind her, labeled 'Evolution.']]\n[[The other person floating around in the sky.]]\n[[A stick figure with a sploshing bucket of water saying, \"I'm gonna shut down the server!\"]]\n[[Two people walking along, one saying, \"But if the Time-Turners worked after Book 3, Rowling would have used one to go back and remove the Time Turner from Book 3.\"]]\n[[The code: \n~$ du -s video\n\n4170882256\n~$ du -s video\n\nA lot.\n~$]]\n[[A cloud.]]\n[[A flock of birds.]]\n[[MU]]\n[[A pixel.]]\n[[A person using a computer on the floor.]]\n[[HOLISM]]\n[[Saturn]]\n[[An atom.]]\n[[Two people star-gazing on a hill.]]\n[[Person one says, \"Someone once told me the great kings of the past look down on us...\" Person two says, \"From the stars?\" The first person replies, \"Just in general.\"]]\n[[The start of Mario World 1-1.]]\n\n\n\n{{Title text: It's turtles all the way down.}}", "alt": "It's turtles all the way down.", "img": "https://imgs.xkcd.com/comics/pixels.png", "title": "Pixels", "extra_parts": {"pre": "", "headerextra": "", "inset": "\n<iframe frameborder=\"0\" scrolling=\"0\" style=\"display: block; margin: 0 auto; border: none; overflow: hidden\" width=\"600\" height=\"600\" src=\"//imgs.xkcd.com/turtledown/frame.html\" id=\"comic-frame\"></iframe>\n", "post": "", "imgAttr": ""}, "day": "3"}