{"month": "2", "num": 1484, "link": "", "year": "2015", "news": "", "safe_title": "Apollo Speeches", "transcript": "[[A stack of speeches, with text above them describing the situation]]\n\nIn 1969, Nixon staffer William Safire wrote a speech for the president to deliver if the Apollo 11 return launch failed, stranding the doomed astronauts on the moon.\n\nUncovered in 1999, it is often call the greatest speech never given.\n\nToday, the full set of Safire's contingency speeches has been found.\n\n((First speech))\nIn Event Astronauts Stranded On Moon\nFate has ordained that the men who went to the moon to explore in peace will stay on the moon to rest in peace.\n\nIn ancient days, men looked at stars and saw their heroes in the constellations. In modern times, we do the same, but our heroes are epic men of flesh and blood.\n\nOthers will follow, and surely find their way home. Man's search will not be denied. But these men were the first, and they will remain the foremost in our hearts. For every human being who looks up at the moon in the nights to come will know that there is some corner of another world that is forever-- <<notes are truncated>>\n\n((Second speech))\nIn Event Spacecraft Goes Missing\nNeil Armstrong, Edwin Aldrin, and Michael Collins went to the moon as ambassadors of peace for all mankind, and all mankind prays that they may yet return safely home.\n\nWe are separated from the moon by a vast gulf of space, against which their tiny vessel appeared as but a drifting speck. For a few brief seconds, we took our eye off them, and despite days of desperate searching, never again was their vessel sighted from Earth.\n\nWhile these men are lost they are not forgotten and their sacrifice will not-- <<notes are truncated>>\n\n((Third speech))\nIn Event Astronauts Abscond With Spacecraft\nWe do not know what led Armstrong, Aldrin and Collins to betray the trust we placed in them, abandon their mission, and steer their vessel toward Mars. Nor do we know what compelled them to transmit such hurtful messages back to earth, heaping contempt on their onetime home.\n\nBut whatever the cause of their dereliction, I call upon the United States to commit itself, before this year is out, to launching a mission to chase down Apollo 11 and return its crew to face Justice. We must not rest until-- <<notes are truncated>>\n\n((Fourth speech))\nIn Event Spacecraft Returns With Extra Astronauts\nWhile this is much we do not understand, tonight all of Earth is united in celebrating the safe return of our brave explorers.\n\nWe of course have many questions, and in the day and weeks to come we will demand answers. How many souls were truly aboard Apollo 11 when it launched? Who are the six men now in quarantine aboard the USS Hornet? What happened-- <<notes are truncated>>\n\n((Fifth speech))\nIn Event Spacecraft Hits U.S.S. Hornet, Crushing Nixon\n\nPresident Agnew: Tonight, we have experienced a great national triumph and a great national loss. We take joy in the safe return from the moon of Neil Armstrong, Edwin Aldrin, and Michael Collins, but that joy is tempered with sorrow as we mourn our president's tragic death beneath their wayward capsule.\n\nRichard Nixon wholeheartedly supported our courageous astronauts as they carried the hopes and prayers of Earth to the heavens, and in the moment of their homecoming, he himself has departed on that ultimate voyage. As we grieve, we must rededicate ourselves to the cause for which our president-- <<notes are truncated>>\n\n((Sixth speech))\nIn Event Spacecraft Accidentally Sold For Scrap And Crushed With Astronauts Inside\nMy fellow Americans, I am as shocked and appalled as you at this stunning and-- <<notes are truncated>>\n\n{{Title text: While our commitment to recycling initiatives has been unwavering, this is not a cost any of us should be expected to pay.}}", "alt": "While our commitment to recycling initiatives has been unwavering, this is not a cost any of us should be expected to pay.", "img": "https://imgs.xkcd.com/comics/apollo_speeches.png", "title": "Apollo Speeches", "day": "9"}