{"month": "2", "num": 1485, "link": "", "year": "2015", "news": "", "safe_title": "Friendship", "transcript": "{{A fictional wikipedia article is depicted here}}\n\n[[Title: FRIENDSHIP]]\nA friendship is a close non romantic relationship between two or more men, a form of affectional or homosocial intimacy.\n\n[[Table of contents]]\nOne, etymology.\nTwo, characteristics.\nThree, portrayal of friendships.\nThree point one, celebrity and fictional friendships.\nThree point two, historical and political friendships.\nThree point three, gay-straight friendships.\nFour, see also.\nFive, references.\n\n[[Title heading: Etymology]]\nFriendship is a portmanteau of the words FRIEND and SHIP. Editor Dave Carnie coined the term in the skateboard magazine BIG BROTHER in the 1990s to refer to the sort of relationships that develop between skaters who spend-- [[section is truncated]]\n\n[[Title heading: Portrayal of friendship]]\n[[Sub heading: celebrity and fictional friendships]]\nA number of celebrities have engaged in friendships with fellow celebrities. Examples include Ben Affleck and Matt Damon, described as quote perhaps THE pioneering friendship in showbiz history unquote which led to a hit off-broadway play-- [[section is truncated]]\n\n[[untitled clipping]]\nfriendship on television has also become more commonplace, with some critics tracing its origins back to such shows as THE ODD COUPLE. In october 2008, TV GUIDE placed Gregory House (Hugh Laurie) and James-- [[section is truncated]]\n\n[[untitled clipping]]\nThe Japanese and Korean music industry actively encourages friendship among male celebrities (particularly members of boy bands) as part of the fan service to please the audience. In fiction, what had once been called buddy films have to a degree been rebranded as friendship films, although-- [[section is truncated]]\n\nCaption: How to improve the quote bromance unquote wikipedia article\n\n[[Title heading: Historical and political friendships]]\nPolitically, the relationship between Bill Clinton and Al Gore has been called a precursor to the friendship. THe relationship between George W Bush and Former press-- [[section is truncated]]\n\n{{Title text: The only other Wikipedia vandalism that I would feel zero remorse about is editing the article on active US militia groups to replace \"militia\" with \"fanclub\".}}", "alt": "The only other Wikipedia vandalism that I would feel zero remorse about is editing the article on active US militia groups to replace \"militia\" with \"fanclub\".", "img": "https://imgs.xkcd.com/comics/friendship.png", "title": "Friendship", "day": "11"}