{"month": "4", "num": 1668, "link": "", "year": "2016", "news": "", "safe_title": "Singularity", "transcript": "((This strip is laid out like a Wikipedia contents table.))\nI love reading the Wikipedia talk entries for articles on individual cities\nContents [hide]\n1 Origin of city's name? \n1.1 Idea for a better name\n1.2 Not how Wikipedia works\n2 Too much promotion of lake festival\n3 Should we mention the murders? \n3.1 Not that notable\n3.2 All cities have murders\n4 Quote verification: even if Voltaire did visit (unlikely), why would he get so angry about our restaurants? \n5 Discuss: new picture\n5.1 Current one looks awfully bleak\n5.2 Gray sky\n5.3 What about this one\n5.4 Also bleak\n5.5 Maybe this place just looks that way\n5.6 Found a better picture, more colourful\n5.7 That's a shot from Disney's Zootopia\n6 \"Mining disasters\" section too long\n6.1 Not really Wikipedia's fault\n6.2 Why is this town so bad at mining?\n7 Infobox picture: I just realised you can see a murder happening in the background\n7.1 This city is terrible\n7.2 Photoshopped out murder\n7.3 Can someone just take a better picture\n7.4 Okay, uploaded a new picture\n7.5 Wait, never mind, I just noticed there's a murder in this one, too\n8 1982 secession still in effect?\n9 I think the murderer is reverting my edits\n10 Why does this article take any position on correct condom use, let alone such a weird and ambiguous one?\n11 Train station \"designed by Andrew Lloyd Webber\"?\n11.1 They probably mean Frank Lloyd Wright\n11.2 I thought so too, but it's apparently not a mistake\n11.3 Didn't know he did architecture\n11.4 Roof collapse\n\n{{Title text: I don't think the Lakeshore Air Crash Museum really belongs under 'Tourist Attractions.' It's not a museum--it's just an area near the Lake Festival Laser Show where a lot of planes have crashed.}}", "alt": "I figured that now that society has collapsed, I wouldn't need to wear clothes anymore, but apparently that violates some weird rule of quantum gravity.", "img": "https://imgs.xkcd.com/comics/singularity.png", "title": "Singularity", "day": "15"}