{"month": "1", "num": 207, "link": "", "year": "2007", "news": "", "safe_title": "What xkcd Means", "transcript": "{{Title: What does XKCD mean?}}\n[[One car of two sitting at a red light makes a right turn, then shifts over to the left and makes a left turn to go back the way it came. It then makes another right and continues on the road past the traffic light. This is shown with a red arrow.]]\n{{Panel title: It means saving a few seconds at a long red light via elaborate and questionably legal maneuvers.}}\n[[Someone on a cell phone is shown in a circle in the panel. A second person in the panel itself is looking at a dog, from which the ringing sound of his phone is coming]]\n<<Ring>>\n{{Panel title: It means having someone call your cell phone to figure out where it is.}}\n[[The mathematical function \"A(g64, g64)=,\" with the 64s subscripted, appears in the panel. Next to the equal sign stands a mathematician, clutching his head.]]\n{{Panel title: It means calling the Ackermann function with Graham's number as the arguments just to horrify mathematicians.}}\nMathematician: Aughhh\n[[An approximately 8 by 8 square of floor tiles is shown; the first, fourth and seventh across in the first, fourth and seventh rows are black and the rest are white. A guy and girl are shown next to it, walking on what is presumed to be the same pattern of floor tiles.]]\n{{Panel title: It means instinctively constructing rules for which floor tiles it's okay to step on and then walking funny ever after.}}\n{{Line indicating the uppermost right black tile: Black tiles okay}}\n{{Line indicating tile directly below it: White tiles directly between black tiles okay}}\n{{Line indicating a white tile in the last column over: Not okay}}\n{{Alt text: It means shuffling quickly past nuns on the street with ketchup in your palms, pretending you're hiding stigmata.}}", "alt": "It means shuffling quickly past nuns on the street with ketchup in your palms, pretending you're hiding stigmata.", "img": "https://imgs.xkcd.com/comics/what_xkcd_means.png", "title": "What xkcd Means", "day": "8"}