{"month": "1", "num": 24, "link": "", "year": "2006", "news": "", "safe_title": "Godel, Escher, Kurt Halsey", "transcript": "Drawn during an unending NASA lecture.\n\n[[Two people are talking, one in a hat.]]\nHatless: it's just so hard to compare kids now with kids in the past. you can't help but to belong to one group or the other.\n\nHatless: and of course every generation seems awful to the one before it. look at quotes from throughout history.\n\nHatted: yeah, and it sure would be nice to have some perspective on some of this stuff. I just don't know what to make of it.\n[[Circles are appearing--maybe snow?]]\n\nHatless: i guess you do what you can to help the people around you and hope it turns out okay.\n\nHatless: in the end, what else can you do?\n\nHatted: lead a crusade?\n\n[[We can no longer see the people, just the circles.]]\nit's presentism, man. the idea that historical context is irrelevant, that we understand it all\n\nthat we need take no warnings from the follies of the past. that we're facing something new.\n\nsocrates couldn't imagine the internet. but people don't change.\n[[We can start to see the corner of a darker circle in the lower right.]]\n\n((The borders between the three panels on this line are cracking.))\n\nhave you seen those collections of historical pornography? talk about historical context.\n\ndid you know the first porn photo was bestial in [[inside a circle:]] nature?\n\nat least that stuff was out of the mainstream [[each word in one circle:]] no just in history\n\n((the three panels have merged into one on each row.))\n\ni don't know about you, but [[circled]] I [[uncircled]] never\neven once seen\n[[The circles are highly variable in size now, and pressed up against a larger one on the right side.]]\n\n[[There is mass of circles of different sizes, with some dark fissures in between, against the side of a large circle which we can see part of in the right half of the panel. They look like cells. There's a tiny square in the center of the giant cell.]]\n\n[[We see only the tiny square, centered. It has a few marks inside it.]]\n\n[[Closer, the square is divided into rectangles of different sizes, each of which has text in it.]]\n\n[[Much closer, we can see fragments of the text. Some are sideways, some are cut off, some are too small to read.]]\nmachine language translated by principles of isomorphism it is a consequence of the Church-Turing thesis that ...\nbut how do you select the channel you wish to se-\nthou ... shou ... palin ... stri ... it is a ... crab ...\n\n[[Closer still, we can just see a huge sideways s and h.]]\n\n[[Those letters are faded and mixed with a faded version of the next panel.]]\n\ngirls take boys away ...\nnever be further than a phone call and a goosebumped shiver away ...\ndrove all night listening to mix tapes ...\nthe past is just practice\n[[There is a heart at the bottom and, in the lower left, the name Kurt.]]\n\n[[The same as the previous panel, but with the words blurred out to scribbles.]]\n\n[[Jagged, shaded shapes and strands start to fall. Faint panel borders appear again. There is a person on the far right.]]\n\n((Back to three panels per row.))\n\n[[A man and woman are standing amid the fragments.]]\n\nMan: There's too much. And so little feels important.\n\n[[The jagged edge of the shaded area is encroaching on the sides of the panel.]]\n\nWhat do you do?\n\n[[We see them from farther away through a rough hole in the shaded area. Bits continue to fall around them.]]\n\n[[She takes his hand.]]\n\n{{Title text: I love the idea here, though of course it's not a great-quality drawing or scan.}}", "alt": "I love the idea here, though of course it's not a great-quality drawing or scan.", "img": "https://imgs.xkcd.com/comics/godel_escher_kurthalsey.jpg", "title": "Godel, Escher, Kurt Halsey", "day": "1"}