{"month": "5", "num": 256, "link": "https://imgs.xkcd.com/comics/online_communities.png", "year": "2007", "news": "", "safe_title": "Online Communities", "transcript": "[[Hand-drawn fantasy style map with land and sea areas representing populations of online communities. Each area or item is labeled.]]\nMap Title Text: Map of Online Communities and related points of interest. Geographic area represents estimated size of membership\nMap Disclaimer Text: Not a complete survey. Sizes based on best figures I could find but involved some guesswork. Do not use for navigation.\nLand Area Labels: The Icy North (Yahoo, Windows Live), AOL, Reunion dot com, Classmates dot com, E-harmony, Faceparty, QWGHLM, Yahoo Games, Mountains of Web 1.0, The Lonely Island, MySpace, Attractive MySpace Pages, The Series of Tubes, Myspace Bands, WOW, Lineage, Second Life, Third Life, UO, EQ, FPXI, 2channel, 4chan, LJ, Xanga, Orkut, Cyworld, Blurty, OK Cupid, Facebook, Piczo, The Compass-Rose-Shaped Island, Broadcaster, Flickr, Last.fm, DeviantArt, Isle of Slash, Numa, Digg, Fark, Reddit, Your Base, Soviet Russia, \n. (slashdot), Spaaarta (YTMND), StumbleUpon, Del.icio.us, The Blogipelago, Sulawesi, Technocrati, BoingBoing, Huntingdon Post, Gays of Web 2.0, The Wikipedia project, MIT, Engadget, Gizmodo, Usenet, XY Singles, MAKE Blog, IRC Isles, Sourceforge.\nSea Area Labels: NOOB Sea, Gulf of YouTube, Bay of Angst, Sea of Culture, Ocean of Subculture, P2P Shoals, Straits of Web 2.0, Here Be Anthropomorphic Dragons, Bay of Trolls, Viral Straits, Sea of Memes, The Wet Sea\nItem Labels: Shipwreck of the SS Howard Dean, Cory Doctrow's Balloon, Stallman's airship, Google's volcano fortress\n{{Alt-text: I'm waiting for the day when, if you tell someone 'I'm from the internet', instead of laughing they just ask 'oh, what part?'}}", "alt": "I'm waiting for the day when, if you tell someone 'I'm from the internet', instead of laughing they just ask 'oh, what part?'", "img": "https://imgs.xkcd.com/comics/online_communities_small.png", "title": "Online Communities", "day": "2"}