{"month": "6", "num": 273, "link": "https://imgs.xkcd.com/comics/electromagnetic_spectrum.png", "year": "2007", "news": "", "safe_title": "Electromagnetic Spectrum", "transcript": "((Everything is one big panel.))\n\nThe Electromagnetic Spectrum\n\nThese waves travel through the electromagnetic field. They were formerly carried by the aether, which was decommissioned in 1897 due to budget cuts.\n\nOther waves:\n- Slinky waves [[Two people hold the ends of a tangled slinky.]]\n- Sound waves [[There is a snippet of a frequency band. Between 20 Hz and 20 KHz is labeled \"Audible Sound.\" Towards the top is a line labeled \"That high-pitched noise in empty rooms.\"]]\n- The wave [[A row of people does a wave.]]\n\n[[Three parallel scales are across the bottom. The first is lambda (m), ranging from 100Mm to 100fm; second is f (Hz), which starts at 1 Hz and reaches 100 THz about 2\n3 of the way along, after which the labels read \"other entertaining greek prefixes like peta- exa- and zappa-\"; last is Q (Gal^2\nColoumb), whose labels are 17, 117, pi, 17, 42, theta, e^pi-pi, -2, 540^50, and 11^2. Above the scales and lined up accurately with the first two are the following:]]\n\n- Power & Telephone (100Mm to 1km)\n- Radio & TV (1km to somewhere between 1m and 10cm); above that are many boxes showing subranges (AM, VHF, UHF, 14\n7 NPR pledge drives, a very thin band for the space rays controlling Steve Ballmer, 99.3 \"The Fox,\" 101.5 \"The Badger,\" 106.3 \"The Frightened Squirrel,\" cell phone cancer rays, CIA, ham radio, kosher radio, shouting car dealership commercials)\n- Microwaves (a bit more than 10cm to a bit more than 1mm); it also has subranges (aliens, just below SETI, wifi, FHF, brain waves, sulawesi, gravity)\n- Toasters (about 1mm to about 100 micrometers)\n- IR (about 100 micrometers to somewhere between 1 micrometer and 1 nm); above that is a bell graph labeled \"Superman's heat vision,\" with a motorcycle driving up the left side labeled \"Jack Black's Heat Vision.\"\n- Visible light (and, under it, visible dark); above that is a bell graph labeled \"sunlight.\" There's a breakout chart above it showing the visible spectrum from 700nm (red) to 450nm (violet). There's an arrow pointing to where octarine would be, somewhere off to the side. Above that are bars showing the absorption spectra for hyrogen, helium, Depends(R) (yellow only) and Tampax(R) (red only).\n- UV (about 100nm to about 10nm)\n- Miller Light (a thin bar around 10nm)\n- An unlabeled section with a thin line above it showing the frequency of the main death star laser\n- A blocked-off portion labeled \"Censored Under Patriot Act.\"\n- X-rays (from about 1nm to about 10pm); a line above shows the frequency of mail-order x-ray glasses. Somewhere vaguely above the 10pm mark is a potato.\n- Gamma\ncosmic rays (10pm and smaller); above that is a bar marked Sinister Google Projects which also trails off into higher frequencies, and blogorays, which are slightly lower.\n\n{{Title text: Sometimes I try to picture what everything would look like if the whole spectrum were compressed into the visible spectrum.  Also sometimes I try to picture your sister naked.}}", "alt": "Sometimes I try to picture what everything would look like if the whole spectrum were compressed into the visible spectrum.  Also sometimes I try to picture your sister naked.", "img": "https://imgs.xkcd.com/comics/electromagnetic_spectrum_small.png", "title": "Electromagnetic Spectrum", "day": "6"}