{"month": "11", "num": 344, "link": "", "year": "2007", "news": "", "safe_title": "1337: Part 4", "transcript": "As time passed, Elaine intensified her hacking work, anonymously publishing exploit after exploit.\n[[Elaine is sitting under tree, typing on a laptop.]]\nTo crack open proprietary hardware, she teamed up with one of the top experts in signal processing and data transferring protocols.\n[[Elaine, wearing a backpack, is walking up to a door where a woman is greeting her]]\nElaine: Hi, mom.\nMrs. Roberts (Elaine's mom): Hello, dear. Did you have fun?\nThey were an unstoppable team.\n[[Elaine is on the floor with her laptop and Mrs. Roberts is on her computer at a table]]\nElaine: I finished the CSS decryptor.\nMrs. Roberts: Good, dear. I'll send it along to Jon.\nAnd were eventually noticed.\n[[Two men in black hats arrive.  One holds a briefcase that reads RIAA and the other holds a briefcase which reads MPAA]]\nRIAA man: Game's over.\nMPAA man: You're coming with us.\n[[Elaine stands up]] \nElaine: Oh, are we?\n[[Mrs. Roberts is still sitting at her computer, typing]]\nMrs. Roberts: Now now, Elaine -\n<<shink>> [[Elaine pulls a knife out]]\n<<shing>> <<shing>> [[The two men each pull a katana out of their briefcase.]]\nMrs. Roberts: Don't let them provoke you, dear.\nMen: We don't want to hurt you, Ma'am.\nMrs. Roberts: Don't by silly. Record company employees can't just go into houses and slice people up.\nRIAA Man: Ah, so you haven't read the DMCA.\nMPAA Man: Title IV, Section 408: Authorization of Deadly Force.\n[[Voice comes from off-panel]]: Hark!\n[[Everyone looks surprised. Mrs. Roberts stands.]]\n[[Bearded man enters, bearing two katanas.]]\nBearded man: Cease this affront to freedom, or stand and defend yourselves!\nMPAA Man: Stallman!\n{{title text: Mrs. Roberts would have gotten up sooner, of course, but she was busy piping find ~ and find ~nomad into xargs shred, just in case.}}", "alt": "Mrs. Roberts would have gotten up sooner, of course, but she was busy piping find ~ and find ~nomad into xargs shred, just in case.", "img": "https://imgs.xkcd.com/comics/1337_part_4.png", "title": "1337: Part 4", "day": "14"}