{"month": "11", "num": 345, "link": "", "year": "2007", "news": "", "safe_title": "1337: Part 5", "transcript": "[[Two RIAA agents attack Elaine and Stallman. Elaine breaks RIAA #1, while Stallman disarms RIAA #2 in a flying manouvre]]\nElaine: Thanks, Stallman!\nStallman: 'Tis my pleasure.\nElaine: So, wait - how did you know we were in trouble?\nStallman: My friend here was tracking these thugs from his balloon. He called me and I thought I'd stop by\n[[Doctorow slides down a rope in red cape & goggles]]\nDoctorow: -Hi! Cory Doctorow - It's a pleasure to meet you.\nElaine: Balloon?\nStallman: Aye. They're up there constructing something called a \"Blogosphere.\"\nDoctorow: Yup! Its twenty kilometers up, just above the tag clouds.\nBobby: Mom, I'm hungry.\nMrs. Roberts: Hush! I'm coding. You ate yesterday.\nStallman: You know, Roberts, GNU could use a good coder like you. Ever thought of joining us?\nElaine: Maybe someday. Right now I've got an industry to take down. Music doesn't need these assholes.\nDoctorow: Begone! And never darken our comment threads again!\nStallman: Well, you won't fix the industry with random exploits. You need to encourage sharing in the public mind.\nDoctorow: Hey; With your music and coding backgrounds, you should get into building better p2p systems.\nElaine: What? Straight-up piracy?\nDoctorow: Sure- have you ever considered it? You'd make a wonderful dread pirate, Roberts\n[[Epilogue]]\nElaine shared her ideas with Bram Cohen, who went on to develop BitTorrent.\nMrs. Roberts spends her time developing for Ubuntu, and defacing the websites of people who make \"your mom\" jokes to her daughter. Elaine still stalks the net. She joins communities, contributes code or comments, and moves on. And if, late at night, you point a streaming audio player at the right IP at the right time - you can hear her rock out.\n~Happy Hacking.~\n{{Alt\ntitle text: This digital music thing will probably reach its endgame sometime in the next decade or so.  These are very exciting times. }}", "alt": "This digital music thing will probably reach its endgame sometime in the next decade or so.  These are very exciting times.", "img": "https://imgs.xkcd.com/comics/1337_part_5.png", "title": "1337: Part 5", "day": "16"}