{"month": "8", "num": 461, "link": "", "year": "2008", "news": "", "safe_title": "Google Maps", "transcript": "Narrator: MY ROAD TRIP WITH MY BROTHER RAN INTO TROUBLE AROUND PAGE THREE OF THE GOOGLE MAPS PRINTOUT\nGoogle Maps Printout: \n<- 70. SLIGHT LEFT AT RT-22 -- GO 6.8 MI\n-> 71. TURN RIGHT TO STAY ON RT-22 -- GO 2.6 MI\n<- 72. TURN LEFT AT LAKE SHORE RD GO -- 312 FT\n-> 73. TURN RIGHT AT DOCK ST -- GO 427 FT\n[[water replaces an arrow]] 74. TAKE THE FERRY ACROSS THE LAKE -- GO 2.8 MI\n[[A car is driving in the dark]]\nPerson 1: OKAY, NOW TAKE DOCK ST TOWARD THE FERRY\nPerson 2: WE'RE SUPPOSED TO TAKE A FERRY? IT'S PAST MIDNIGHT, AND THESE WOODS ARE CREEPY\nPerson 1: GOOGLE MAPS WOULDN'T STEER US WRONG.\n[[Person 1 and Person 2 stand outside the car.  The ferry has a sign on it reading CLOSED.\n[[Person 1 stands holding the google map print out next to Person 2 in the dark]]\n[[Still standing in the dark]]\nPerson 1: LET ME SEE THOSE DIRECTIONS.\nGoogle Maps Printout:\n[[water replaces an arrow]] 74. TAKE THE FERRY ACROSS THE LAKE -- GO 2.8 MI\n[[a diagonal upward arrow]] 75. CLIMB THE HILL TOWARD HANGMAN'S RIDGE, AVOIDING ANY MOUNTAIN LIONS -- UP 1,172 FT\n[[a \"u-turn\" arrow]] 76. WHEN YOU REACH AN OLD BARN, GO AROUND BACK, KNOCK ON THE SECOND DOOR, AND ASK FOR CHARLIE -- GO 52 FT\n[[a van]] 77. TELL CHARLIE THE DANCING STONES  ARE RESTLESS.  HE WILL GIVE YOU HIS VAN. -- CAREFUL\n[[a picture of the straw man]] 78. TAKE CHARLIE'S VAN DOWN OLD MINE ROAD.  DO NOT WAKE THE STRAW MAN. -- GO 97 MI\n-> 79. TURN LEFT ON COMSTOCK.  WHEN YOU FEEL THE BLOOD CHILL IN YOUR VEINS, STOP THE VAN AND GET OUT. -- GO 3.2 MI\n[[down arrow]] 80. STAND VERY STILL. EXITS ARE NORTH, SOUTH, AND EAST, BUT ARE BLOCKED BY A SPECTRAL WOLF. -- GO 0 FT\n[[a picture of a spectral wolf]] 81. THE SPECTRAL WOLF FEARS ONLY FIRE.  THE GOOGLE MAPS TEAM CAN NO LONGER HELP YOU, BUT IF YOU MASTER THE WOLF, HE WILL GUIDE YOU.  GODSPEED. -- GO ?? MI.\n{{Alt Text: Apparently Google assumes you're traveling during the ferry's normal operating hours. We lost two hours circling that damn lake (to say nothing of the Straw Man).}}", "alt": "Apparently Google assumes you're traveling during the ferry's normal operating hours.  We lost two hours circling that damn lake (to say nothing of the Straw Man).", "img": "https://imgs.xkcd.com/comics/google_maps.png", "title": "Google Maps", "day": "11"}