{"month": "9", "num": 472, "link": "https://www.amazon.com/House-Leaves-Mark-Z-Danielewski/dp/0375703764", "year": "2008", "news": "(Today's comic is a parody of <a href=\"https://www.amazon.com/House-Leaves-Mark-Z-Danielewski/dp/0375703764\">House of Leaves</a>.)", "safe_title": "House of Pancakes", "transcript": "{{All instances of the word \"House\" are in blue.}}\nEvery day a new city, a new IHOP. And yet every night the dreams get worse. I ply the highways, a nervous eye on the rear-view mirror, the back seat piled with stolen menus. Their doors are opened 24 hours, but forever closed to my soul. This is what my life has become. This is my hell.\n{{sidenote left: International}}\nHouse of Pancakes\n{{scribbled-out sidenote right: BLOGSPOT}}\nStrawberry Banana Pancakes\nFour pancakes filled with sliced fresh banana and crowned with cool strawberry topping, more [17] bananas and [23] whipped topping.\n[17] Driven by a nameless fear, a whisper in the dark behind me, I flee ahead of I know not what. Whenver I turn, there's nobody behind me.  And yet someone is clearly stealing the ketchup. WHY?\n[[The footnote is covered in fingerprints.]]\n[23] My life is feeding,\nfleeing,\nfighting,\nand\nforgetting.\n[[The above note is sandwiched in sideways in between the Stuffed French Toast and Ham and Egg Melt.]]\nRooty Jr.\nA kids only [19] version of our house signature Rooty Tooty. One scrambled egg, one strip of bacon, one pork sausage link and one fruit-topped buttermilk pancake.\n[19] The decision not to hyphenate \"kids only\" is likely connected to the omission of the serial comma. I wonder if the author is British. I wonder if he sleeps at night.\n[[The following passages are have a red substance underneath them, probably ketchup.]]\nRise 'N Shine\nTwo eggs, toast and hash browns served with your choice [21] of two strips of bacon or two pork sausage links.\n[21] {{illegible}} rent a storage unit. Sleep there. Fill it with pancakes. Leave.\nStuffed French Toast\nCinnamon raisin French [18] toast stuffed with sweet cream cheese filling, topped with cool strawberry or your choice of fruit compote and whipped topping.\n[18] Nightmares again. I wake up covered in sweat, and what appears to be a thin sheen of maple syrup\n{{Handwritten, underlined}} WHO IS MOHAWK GIRL?\n[[Slanted 90 degrees left]]\nHam & Egg Melt\nGrilled sourdough bread stuffed with ham, scrambled eggs, Swiss and American cheeses. [20]\n[[At normal orientation]]\n[20] Ordered this in at an IHOP in Rochester, New York. There was blood on the floor. Some of it was mine.\n[[Comic strip]]\nEnough with your pancakes.\nEnough with your GOD DAMN pancakes.\nThe Big Steak Omlette\nTender strips of steak, hash browns, {{redacted}} tomatoes and Cheddar cheese. Served [22] with house salsa.\n[22] Woke up in Las Vegas.  They're closing the Star Trek Experience today.  The IHOP up the strip had pancake platters named after various states.\nNone of them sounded like home.\n{{Alt text: Fuck it, I'm just going to Waffle House.}}\n{{External link: http:\nwww.amazon.com\nHouse-Leaves-Mark-Z-Danielewski\ndp\n0375703764}}", "alt": "Fuck it.  I'm just going to Waffle House.", "img": "https://imgs.xkcd.com/comics/house_of_pancakes.png", "title": "<span style=\"color: #0000ED\">House</span> of Pancakes", "day": "5"}