{"month": "10", "num": 496, "link": "", "year": "2008", "news": "", "safe_title": "Secretary: Part 3", "transcript": "[[The confirmation hearings begin...]]\nSenator: It appears you have quite an arrest record.\nSenator: Is it true you completely disassembled someone's car outside a Starbucks?\nHat Guy: It was parked across two spaces.\nSenator: You stole a red Fokker triplane and strafed the snoopy float at the Macy's Thanksgiving day parade?\nHat Guy: Got three mimes, too.\nSenator: You disrupted a 9\n11 truth meeting, insisting the Twin Towers never actually collapsed?\nHat Guy: I have evidence! Don't trust the media! Wake up, sheeple!\nSenator: You were fired from Radio Shack after you built a death ray and vaporized a customer?\nHat Guy: I was just testing it! Figures that'd be the one day there was a shopper in the aisle.\nSenator: And you were thrown out of Microsoft headquarters for... trying to feed a squirrel through a fax machine?\nHat Guy: I forgot about that! it was part of an argument with Steve Ballmer about Vista.\nWhich I won, by the way.\nSenator: This is the worst history of vandalism, gleeful mayhem, and general recalcitrance we've seen in a nominee since Ruth Bader Ginsburg. \nSenator: And this--you stole a nuclear submarine?\nHat Guy: I plead the third.\nSenator: You mean the fifth?\nHat Guy: No, the third.\nSenator: You refuse to quarter troops in your house?\nHat Guy: I have few principles, but I stick to them.\nMeanwhile...\n[[Aboard Ron Paul's blimp]]\nPilot: We're nearing Washington, sir.\nWait... There's something ahead on the sensors.\nPilot: It's a balloon.\nRon Paul: ...Oh, no.\n{{Title Text: He actually installed each piece in a different car on the lot, then built a new car in the spot from the displaced pieces. It's a confusing maneuver known as the auto-troll shuffle.}}", "alt": "He actually installed each piece in a different car in the lot, then built a new car in the spot from the displaced pieces.  It's a confusing maneuver known as the auto-troll shuffle.", "img": "https://imgs.xkcd.com/comics/secretary_part_3.png", "title": "Secretary: Part 3", "day": "29"}