{"month": "10", "num": 498, "link": "", "year": "2008", "news": "", "safe_title": "Secretary: Part 5", "transcript": "{{The Senate. Hat Guy sits before the committee at his hearing to become Internet Secretary.}}\nChairman: We were convened here to review your nomination for the position of internet secretary.\nChairman: However, on review of your qualifications, we've decided to sentence you to death.\nChairman: An unorthodox move, sure. But the vote was unanimous.\n{{Hat Guy is leaning back in his chair.}}\n[[Meanwhile . . .]]\nTron Paul: There's no grid! How do I steeeeer!!!!!\n{{Back at the Senate. Hat Guy is standing.}}\nHat Guy: Well, it's been fun. But I was never actually interested in taking the position. Good lord; listening to internet arguments all day? No thank you.\nChairman: Then why did you sit through all those hearings?\nHat Guy: It was taking us a while to move the pumps into the maintenance tunnels.\n{{The committee members murmur among themselves.}}\n{{There is a panel in the floor between Hat Guy and the committee.}}\n<<RUMBLE>>\n<<plink>> <<plink>>\n{{A red playpen ball bursts out of the panel and rolls towards the committee chairman.}}\n<<plink>>\n{{The room is still. Hat Guy's arms are folded.}}\n{{A geyser of red, white, and blue playpen balls bursts through the panel in the floor. Hat Guy is already gone.}}\n<<FOOM>>\n{{The committee members chase Hat Guy out the door as the Senate floor floods with playpen balls.}}\n{{The chase continues into the rotunda, as does the flood of playpen balls.}}\n{{Hat Guy stands in the middle of the rotunda as it fills with playpen balls, surrounded by members of the committee.}}\nCommittee Members: Security! Someone!\nCommittee Members: Get Him!\n{{Tron Paul bursts through the wall.}}\n<<CRASH>>\nTron Paul: Aaaaa!\n{{Hat Guy grabs the bottom of the lightcycle as Tron Paul goes by.}}\n<<snag>>\nTron Paul: Hey!\n{{Hat Guy swings onto the top of the light cycle.}}\n{{Hat Guy crouches on top of the light cycle.}}\nTron Paul: Get Off!\n{{Tron Paul and Hat Guy crash through the far wall of the rotunda.}}\n<<CRASH>>\n{{Tron Paul hits the ground.}}\n<<WHAM>>\nTron Paul: Ow!\n{{Hat Guy runs away.}}\nTron Paul: Ughhh.\n{{The lightcycle disappears.}}\nTron Paul: I feel queasy . . .\nCory Doctorow, above: Hey!\nHat Guy: Hi, Cory.\nCory Doctorow: Need a lift?\nHat Guy: Sure.\n{{Hat Guy and Cory Doctorow depart in Doctorow's balloon.}}\nCory Doctorow: So are you, like, a fugitive now?\nHat Guy: Well, I never did give them my name . . .\n[[But in the rotunda]]\n{{Senators play in the playpen balls.}}\nSenators: Let's jump down here from the balcony!\nSenators: Senior senators first!\nSenators: Wheeee!\nSenators: I'm a submarine!\n[[All is forgiven.]]\n{{title text: And they choose Al Gore as Internet Secretary.}}", "alt": "And they choose Al Gore as Internet Secretary.", "img": "https://imgs.xkcd.com/comics/secretary_part_5.png", "title": "Secretary: Part 5", "day": "31"}