{"month": "11", "num": 505, "link": "", "year": "2008", "news": "", "safe_title": "A Bunch of Rocks", "transcript": "[[Man is walking, alone in desert.  Man is narrating his own situation]]\nNarrator: So I'm stuck in this desert for eternity.\nNarrator: I don't know why. I just woke up here one day.\nNarrator: I never feel hungry or thirsty.\nNarrator: I just walk.\nNarrator: Sand and rocks...\nNarrator: ...stretch to infinity.\nNarrator: As best as I can tell.\n[[Man is sitting in the desert, in a contemplative position]]\nNarrator: There's plenty of time for thinking out here.\nNarrator: An eternity really.\n[[Man is sketching stuff in the sand]]\nNarrator: I've rederived modern math in the sand\nNarrator: and then some.\n[[Different graph types are depicted]]\nNarrator: Physics too.  I worked out the kinks in quantum mechanics and relativity.\nNarrator: Took a lot of thinking, but this place has fewer distractions than a Swiss patent office.\n[[Man is walking along the desert, laying out rocks]]\nNarrator: One day I started laying down rows of rocks.\n[[Man continues to deploy rocks]]\nNarrator: Each new row followed from the last in a simple pattern.\n[[Image continues to zoom out showing laid out rocks]]\nNarrator: With the right set of rules and enough space,\nNarrator: I was able to build a computer.\nNarrator: Each new row of stones is the next iteration of the computation.\nNarrator: Sure it's rocks instead of electricity, but it's the same* thing.\nNarrator: Just slower.\nNotation: *Turing-complete\n[[Man in contemplative pose]]\nNarrator: After a while, I programmed it to be a physics simulator.\n[[Image of binary encoding depicted in rocks]]\nNarrator: Every piece of information about a particle was encoded as a string of bits written in the stones.\n[[Representations of two particles interacting]]\nNarrator: With enough time and space, I could fully simulate two particles interacting.\n[[Man standing before the vastness of the desert]]\nNarrator: But I have infinite time and space.\n[[Depiction of a universe]]\nNarrator: So I decided to simulate a universe.\n[[Man is walking about his rocks, changing placement]]\nNarrator: The eons blur past as I walk down a single row.\n[[Zoom out of the rows of rocks]]\nNarrator: The rows blur past to compute a single step.\n[[Shows placement of two rocks]]\nNarrator: And in the simulation...\n[[The two rocks have moved; an after-image of their previous placement is present]]\nNarrator: ...another instant ticks by.\n[[Man #2 observes a mote of dust vanish]]\nNarrator: So if you see a mote of dust vanish from your vision in a little flash or something\n[[Man is rearranging rocks]]\nNarrator: I'm sorry. I must have misplaced a rock...\nNarrator: ...sometime in the last few billions and billions of millennia. \n[[Man in front of the vastness of his infinite desert]]\nNarrator: Oh and...\n[[Man is in a classroom setting, girl and professor are present]]\nNarrator: if you think the minutes in your morning lecture are taking a long time for _YOU_...\n{{title text: I call Rule 34 on Wolfram's Rule 34.}}", "alt": "I call Rule 34 on Wolfram's Rule 34.", "img": "https://imgs.xkcd.com/comics/a_bunch_of_rocks.png", "title": "A Bunch of Rocks", "day": "17"}