{"month": "4", "num": 566, "link": "", "year": "2009", "news": "", "safe_title": "Matrix Revisited", "transcript": "Narrator: Today was the ten-year anniversary of the release of 'The Matrix'.  I sat down to watch it again.\nWoman: Holy Fuck, ten years ago?\n{{Replay of various scenes from The Matrix..}}\n[[Scene 1]]\nMorpheus: Unfortunately, no one can explain what the matrix is.  You have to see it for yourself.\nTrinity (correcting Morpheus): Sure you can.  It's a computer simulation in which you live, thinking it's reality.\nNeo: Oh.\nTrinity (to Morpheus, who is glaring at her): ... What?  Look, maybe you just suck at explaining.\n[[Scene 2]]\nMorpheus (to Neo): ...Or you take the red pill, and I show you how deep the rabbit hole goes.\n[[Neo takes BOTH pills from Morpheus...]]\n[[Neo crushes both the red and blue pills into purple powder on a table top...]]\n[[Neo snorts the purple powder...]]\n[[Morpheus and Neo are shown upside down in a frame with inverted colors, i.e., black background with white lines]]\nMorpheus: NOW look what you've done.\nNeo: Where are we?\nMorpheus: I have no idea.\n[[Scene 3]]\n[[Neo, wearing the long  black trench coat, at a metal detector, is accosted by the security guard.]]\nGuard: Please remove any keys, metallic items, weapons--\n[[Neo opens his trench coat, his back to the reader, towards the guard, who is facing the reader.  The reader can't see what Neo has under his coat.]]\n[[Same scene as above, but side view: Neo, on the left, is opening his coat toward the guard, who is on the right.  Nobody speaks.]]\n[[Side view again.]]\nGuard: Eww.\n{{End of scene replays}}\n[[View of room, where three characters have obviously just finished watching The Matrix. Man1 is sitting on the floor nearest to the TV.  Woman is sitting on the floor, farther from the TV.  Man2 is sitting on a chair, farthest from the TV.]]\nMan1: I forgot how good that movie was.\nMan2: Wanna put on the other two?\n[[Man1 has turned to face Woman.  They exchange looks without speaking.]]\n[[View of room, which is now empty, as is the chair.]]\n<<Sounds from off panel:  Crash \n Wham \n Someone saying \"Ow! Ow!\">>\n[[Man1 and Woman are back in the room, but the chair is still empty.  Man2 is nowhere to be seen.]]\nMan1: I forgot how good that movie was.\nWoman: Too bad they never made any sequels.\nMan1: True.", "alt": "I actually remember being entertained by both the sequels while in the theater.  They just don't hold up nearly as well in later comparison.", "img": "https://imgs.xkcd.com/comics/matrix_revisited.png", "title": "Matrix Revisited", "day": "8"}