{"month": "5", "num": 580, "link": "", "year": "2009", "news": "For this week, xkcd will update once a day (through Friday).", "safe_title": "The Race: Part 4", "transcript": "[[Randall\nxkcd\nman and Nathan Fillion are ready on the start line on their electric skateboards]]\nVoice off panel: On your mark...\nVoice: Get set...\nNathan: Remember episode 11, when I got all naked in that desert?\nVoice: Go!\n[[Nathan speeds away leaving Randall standing at the start line]]\nvoice: ... I said \"Go.\"\nvoice: someone throw some water on him\nRandall: Can't...get it...out of my head...\n[[Nathan on walkie talkie, speeding on his skateboard]]\nNathan: He's right behind me. Kaylee, I'm gonna try a Crazy Ivan.\nKaylee [[on walkie talkie]]: That doesn't make any sense, Nathan.\nNathan: Trust me.\nKaylee: No, I mean it's not a skateboard maneuver[sic]. The concept doesn't even apply to this situation.\nNathan [[via walkie talkie]]: That's why it just might work!\nKaylee: No, that's the opposite of true!\nNathan: On my mark, override the remote differential and throw her into a spin.\nKaylee [[via walkie talkie]] okay, but-\nNathan: Mark!\n<<WHAM>>\n[[Nathan lying injured on the ground next to his skateboard, Randall\nMan cruises past]]\n<<Whirrrrrrrr>>\n[[Nathan, trying to stand up]]\nNathan: I'm down. Tell Summer \"The chickens are in the hayloft. Plan Gamma is a go.\"\n[[Nathan, one foot on skateboard, looking at walkie talkie]]\n<<mumbling from walkie talkie>>\nKaylee: She says, \"Plan gamma acknowledged. The meerkats are in the bad.\n[[Summer Glau is walking off panel]]\nKaylee [[to walkee talkie]]: So we're good?\nNathan: Hard to tell with her. Do you see an actual bag of meerkats?\nKaylee: No.\nNathan: Then we're probably good.\n[[Randall\nMan screeching to a halt as he sees Summer Glau]]\nRandall: Oh! Hi, Miss Glau! I'd love to talk, but Nathan's back on his feet and catching up.\n[[Summer grabs Randalls arm]]\n<<Grab>>\nRandall: Wha-\n[[Summer kicks Randall in the face whilst pulling his arm towards her, he flies off his skateboard]]\n[[Summer walking away as Randall lies crippled on the floor with his sunglasses beside him]]\n[[Randall still lying on the floor]]\nRandall [[thinking]]: I've never been so turned on in my life.\n{{Alt text: Things are rarely just crazy enough to work, but they're frequently just crazy enough to fail hilariously. Title: The Race: Part 4. Comic: xkcd. Tags: firefly, nathan fillion, summer glau, crazy ivan, serenity, whedon}}", "alt": "Things are rarely just crazy enough to work, but they're frequently just crazy enough to fail hilariously.", "img": "https://imgs.xkcd.com/comics/the_race_part_4.png", "title": "The Race: Part 4", "day": "7"}