{"month": "6", "num": 602, "link": "", "year": "2009", "news": "", "safe_title": "Overstimulated", "transcript": "[[There is a group of people.  Three women and four men.  They are standing around a table with a drink on it.]]\nMan #3: Have you seen John lately?\n\nWoman #3: He and Claire blew off this party to see Jeff.\nMan #4: They do that a lot.\n\nMan #1: Yeah; I don't know what his problem is with hanging out lately.\nMan #3: He's like Katie - ever noticed how she only goes somewhere if Jeff's there?\n\nSomebody: It's so lame how s he hangs around him even when he's not single:\nSomebody: HE LIKES IT. \nSomebody: SOMEONE SERIOUSLY NEEDS TO DATE HER.\nSomebody: TOTALLY.\nSomebody: And honestly I feel like a jerk but I wouldn't mind if she hung around with us a little less. She needs other friends, you know!\n[[Man #2 is cringing away from all the text; none of the word is attributed to specific people.]]\n\n[[Man #2 peels a hole in the panel.  The numbers '1', '2', and '3' are visible through the gap.]]\nSomebody: HAVE YOU \nNOTICED\n HOW EVERY DUDE SHE DATES IS A TOTAL DRUGGIE?\nSomebody: I'm glad I'm not the only one who thought that was weird.\nSomebody: Michelle dates potheads like Elaine but at least they both have real jobs.\nSomebody: Michelle does? She designs those book covers, right?\nSomebody: And it's not like she smokes a lot.\nSomebody: Elaine is one of those girls who\n\n[[The previous panel's text appears again, but peeled back even further.  Man #2 looks up.]]\n1 2 3 4 5 6 7 8 9 10 11 12\n\n[[The man starts taking down the prime numbers.]]\n1     4   6   8 9 10    12    14 15\n  2 3   5   7        11    13\n[[The man grabs and squeezes the 2, so it is half as wide and twice as tall.]]\n\n[[A formula: \\Sum_{i=1}^{\\infty}{1\nP_i} = h]]\n[[ie. The sum from 1 to infinity of the inverse of each prime.]]\n[[The panel shows a 2 that is 2 units tall and 1\n2 wide, a 3 that is 3 units tall and 1\n3 wide, and so on.  The man is moving the 7.]]\n\n[[Man #2 writes h = infinity.  The numbers are piled on their side next to a scale.]]\nVoice: Don't you agree?\nVoice: Hey, wake up.\n\nMan #1: You zoned out or something.\nMan #2: Sorry; I must be... tired.\n\nMan #1: I don't blame you. All day cooped up working on papers.\nMan #3: Must be nice to get out and relax, huh?\nMan #2: Yeah.\n[[Girl #3 reaches for the glass on the table.]]\n\n{{Title text: My favorite thing to do at parties is to talk judgementally about people who aren't there.}}", "alt": "My favorite thing to do at parties is to talk judgmentally about people who aren't there.", "img": "https://imgs.xkcd.com/comics/overstimulated.png", "title": "Overstimulated", "day": "26"}