{"month": "11", "num": 657, "link": "https://xkcd.com/657/large/", "year": "2009", "news": "This comic is also available as a poster <a href=\"https://store.xkcd.com/collections/posters/products/movie-narrative-charts-poster\">here</a>!<br />Click on today's comic to view the full-size version!", "safe_title": "Movie Narrative Charts", "transcript": "These charts show movie character interactions. The horizontal axis is time. The vertical grouping of the lines indicates which characters are together at a given time.\n\n[[Lord of the Rings. A mass of colored lines weaves back and forth across the chart, representing various characters. Sauron is represented by a huge black bar at the bottom with branches for nazgul, orcs, etc. Major locations (Moria) and plot points (the breaking of the fellowship) are marked. Gandalf, especially at the beginning, jumps all over the map in a short time. Eagles appear and then disappear a couple of times. Treebeard's line is flat except for the march to Isengard. At the end, the ship to the West drifts off into a corner.]]\n\n[[Star Wars (original trilogy). This chart is simpler. Luke, mostly accompanied by R2-D2, joins and parts from other sets of characters. There's a dotted alternative path on Jabba's line for the special edition. Yoda appears about halfway through (where Luke's Jedi training is marked). All the surviving lines group up at Endor except for Vader, the Emperor, Luke, and Lando; after the climactic duel, the latter two join the rest.]]\n\n[[Jurassic Park. The human characters are in black; dinosaurs are in red. Dilophosaurus appears briefly to eat Nedry and then fades out again. The three raptors are together at the beginning, but split up about halfway through. One has a dotted portion of line between \"locked up\" and \"escapes.\" In the meantime, they cut off the lines of Arnold and Muldoon. The raptor lines all end when t-rex's swoops down to meet them at the end, and all the surviving humans leave together.]]\n\n[[12 Angry Men. The lines are labeled Juror 1 through Juror 12. They are all perfectly horizontal and parallel.]]\n\n[[Primer. Three lines start on the left labeled Abe, Aaron, and Granger. They enter a mass of scribbling. Somewhere vaguely towards the end, three lines emerge and fade out, all labeled with question marks.]]\n\n{{Title text: In the LotR map, up and down correspond LOOSELY to northwest and southeast respectively.}}", "alt": "In the LotR map, up and down correspond LOOSELY to northwest and southeast respectively.", "img": "https://imgs.xkcd.com/comics/movie_narrative_charts.png", "title": "Movie Narrative Charts", "day": "2"}