{"month": "3", "num": 715, "link": "", "year": "2010", "news": "", "safe_title": "Numbers", "transcript": "Google Result for Various Phrases:\n{{Each panel is a scatterplot of the described X against the number of Google hits, with trend lines. The scales vary.}}\n\n<X> Bottles of Beer on the Wall\n[[There are peaks at 1, 49, 73, and 99. A dip in the middle is marked \"They lose steam at 66.\" After 99 is a steep dropoff. The largest peak is around 100,000 hits.]]\n\nI've Had <X> Boy\nGirlfriends\n[[Both lines descend at roughly the same rate from 1 to 10, although the boyfriend graph is smoother; the girlfriend graph has a small peak at 4 and a small dip at 6. The peaks are between 100,000 and 1,000,000 hits.]]\n\nI'm in <X>st\nnd\nrd\nth Grade\n[[The curve is a bell peaking at 7th grade and about 500,000 hits. A second line labeled \"Including Junior, Senior, etc.\" follows the bell curve until the peak, then dips only slightly for 10th grade and resumes climbing.]]\n\nI Have a\nan <X>-Inch Penis\n[[The line ascends shallowly from 100,000 hits for 3 inches to a peak of 180,000 for 9 inches, then descends steeply to 20,000 for 13 inches.]]\n\nI'm a\nan <X>-Cup\n[[A has a few hundred thousand hits; the graph dips to a few thousand for C, peaks again around 100,000 for E, and then tails off.]]\n\nI'm <X> and Have Never Had a Boyfriend\n[[The graph is mostly a simple bell, starting and ending around 300,000 hits for 13 or 21, but there is a sharp peak of 700,000 at 18 (well above the trend line).]]\n\nDrink <X> Glasses of Water a Day\n[[There are barely any hits below 4 or above 12; between the two it rises steeply to about 1,000 hits, with a steep, narrow peak of 10,000 at 8.]]\n\nThere Are <X> Lights\n[[The graph descends smoothly from several hundred thousand hits for 1 to about 10,000 for 10, except for a peak of about 1,000,000 for 4.]]\n\nI Got <X> Problems\n[[The plot is extremely jagged, with the largest peak of 10,000,000 hits at 99, another of 10,000 at 96, and 100 and 88.]]\n\nMy IQ Is <X>\n[[A smooth curve starts and ends at a few thousand hits for around 85 and around 170, with the peak at several tens of thousands for 140, but there are several prominent outliers: 100, 110, 133, and 142 are all around 100,000 hits, and 147 is around 1,000,000.]]\n\n{{Title text: The typical internet user (who wants to share) has an IQ of 147 and a 9-inch penis. Well, better than the reverse, I guess.}}", "alt": "The typical internet user (who wants to share) has an IQ of 147 and a 9-inch penis. Well, better than the reverse, I guess.", "img": "https://imgs.xkcd.com/comics/numbers.png", "title": "Numbers", "day": "17"}