{"month": "4", "num": 730, "link": "", "year": "2010", "news": "", "safe_title": "Circuit Diagram", "transcript": "{{Title text: I just caught myself idly trying to work out what that resistor mass would actually be, and realized I had self-nerd-sniped.}}\n\n((A large and complicated circuit diagram.))\n\n[[In the upper left corner there is a map scale, labeled with 1 mi (1 km).\n\nUnderneath the scale is an antenna symbol that leads down to a blender, an Arduino; labeled with \"Arduino, just for blog cred\"; and a chip; \"Most expensive chip available\".\n\nTo the right of the antenna there is the symbol for an inductor that has it's lower terminal going into a the left terminal of pattern that looks like a highway cloverleaf.  The upper terminal leads to a line that is going to the upper terminal of that cloverleaf and to a battery symbol (with the + and - symbols on the wrong ends) with a value of â\u0088\u009a2V.  The right terminal of the cloverleaf is going into a resistor symbol label \"120Î© or to taste\".  Connected to the other terminals of the resistor and battery is a switch that is labeled \"glue open\".  The bottom of the two lines has a transistor with two emitters, one P and one N, and no collector.  The P-type emitter is connected to the top line and a jar of scarab beetles.  Above the beetles is a resistor labeled \"brown blue orange\". To the right is an unlabeled resistor with a center tap going into a capacitor, with a ground on the other end.  Above the capacitor is a diode, and below an inductor.  To the right is another inductor.  The two inductors and ground are all covered by a \"solder blob\".  The rightmost component is a \"666 timer\" that has pin 5 going into a question mark.\n\nBack to the left side, below and to the left of the cloverleaf is a compass rose.  The bottom terminal of the cloverleaf is connected to a battery, labeled 50V, with grounds on both sides.  To the right of the battery is a long horizontal wire that is labeled \"pull this wire really tight.\"  That wire is hooked up to a vertical wire that connects to the N-type emitter of the transistor above it.  To the right is an AC source that is labeled 240V, shorted out, with a label on the short \"omit this if you're a wimp.\"  To the right of that is an inductor that is labeled with \"11kg\", a batman symbol, and a squirrel.\n\nBack to the left end of the diagram, where the blender is, there is a wire that is labeled as a distance 3\n8\" from the wire with the 50V battery.  To the right there is a frowny face, then a vertical wire with a 90 degree bend labeled \"caution â\u0086±\".  That leads into a balloon.  Under the balloon is an inductor symbol with a line on the bottom edge labeled as \"warm front\".\n\nUnderneath the blender and to the right of the Arduino is a resistor labeled \"ë\".  To the right is an electric eel, a capacitor, an unlabeled resistor, and a gob of hot glue attached to a chip with an inverter hooked to an XOR gate, both with feedback into each other.  Under the electric eel is a neck strap.  To the right of the XOR gate and inverter is a bridge rectifier labeled as \"Moral rectifier\"  to the right again is a bottle of magic smoke, under that a fishing bobber and then a broken wire labeled with a question mark. \n\nUnder the most expensive chip available there is a vertical wire labeled with \"electrons single file\".  To the right is a switch labeled \"hire someone to open and close switch real fast.\"  To the right of that is a contact labeled \"touche tongue here\".  Below that is a resistor labeled \"5Î© (decoy)\" with only one terminal connected.  To the right of the contact is a methyl group attchaed to a wire.  To the right of the methyl group is a complex mesh of 1Î© resistors labeled with \"oh, so you think you're such a whiz at EE201?\"\n\nConnected to the wire labeled \"electrons single file\" is a wire bent in a U shape with an upside-down ground on the end.  To the right is a flux capacitor with the bottom wire labeled I-95.  To the right of that is a wire labeled yarn, then an arena with two diodes going in and one leaving.  The right diode has a ground on its anode labeled \"bury deep, but not too deep.\"  To the right of that is a motor labeled vibrator, resistor with a value of Ï\u0080, and a 500V AC source.\n\nUnder the flux capacitor is a wire that leads out of frame with a label \"â\u0086\u0090 to center of sun\".  To the right is a 55 MPH speed limit sign, then an SR latch (flip-flop) labeled \"may use an actual sandal instead\".  Connected to the Q of the SR latch is a holding pen and to the inverting Q output is a wire in a knot, a resistor labeled \"8mm\", a resistor symbol labeled \"not a resistor; wire just does this\", and a motor symbol labeled \"to scale\".\n\nUnder the wire that leads off to the center of the sun is a tangled mess of wires connected and jumping over each other, then a photo diode labeled \"tear collector\".  Under the tear collector is a wire in the shape of a ECG.  To the right is a light bulb, a capacitor-looking symbol labeled 3 liters, a resistor labeled yes, an unlabeled inductor, a resistor with a question mark as a label.  To the right of all that is an inductor labeled \"take off shirt while wiring this part.  Ooh, yeah, I like that.\"  Finally, in the lower right hand corner is a ground symbol immersed in a beaker of holy water.]]", "alt": "I just caught myself idly trying to work out what that resistor mass would actually be, and realized I had self-nerd-sniped.", "img": "https://imgs.xkcd.com/comics/circuit_diagram.png", "title": "Circuit Diagram", "day": "21"}