{"month": "6", "num": 748, "link": "", "year": "2010", "news": "", "safe_title": "Worst-Case Scenario", "transcript": "[[Two reporters, a man and a woman, point microphones toward a scientist.]]\nFemale reporter: Dr. Scientist! The \"Top Kill\" has failed! What's the worse-case scenario for the gulf?\nDr. Scientist: The worst-case scenario is what's happening now.\n\nReporter, out of frame: Yes, but is there any way it could get worse?\nDr. Scientist: Sure, but there are real disasters happening now, and you're substituting speculation and voyeurism for the investigative journalism we--\nReporter: Screw this! Let's ask Michael Bay.\n\n[[The reporters, now joined by a camerawoman, approach Michael Bay with their microphones.]]\nMichael Bay: The worst case? A hurricane tracks into the gulf, whipping the surface of the spill into a frothy mix of oil and air.\n\n[[An alligator-filled conflagration atop a massive ocean wave approaches land.]]\nMichael Bay, narrating: As the storm surges through the bayous, sparking power lines ignite the fuel\nair mixture into a roiling, alligator-filled wall of flame.\n\n[[A map of the gulf coast of Louisiana and southwest Mississippi is depicted with the current routes of the Mississippi and Atchafalaya Rivers highlighted. An arrow indicating a new primary flow of the Mississippi's waters into the Atchafalaya points toward southern Louisiana.]]\nMichael Bay, narrating: Plowing northward, the fire hurricane destroys the Old River Control Structure in Concordia, rerouting the Mississippi westward and sweeping Morgan City and the heart of cajun country out to sea.\n\nMichael Bay: James Carville emerges from the conflagration riding a burning alligator...\nReporter, out of frame: Will this affect the midterm elections?\nMichael Bay: \nMassively.\n\n\n{{Title text: To get serious analyses of hurricanes and oil slicks, see Jeff Masters' blog. To get serious discussions of worst-case scenario thinking, see Bruce Schneier's blog. To get enough Vitamin D, don't read any blogs and go outside instead.}}", "alt": "To get serious analyses of hurricanes and oil slicks, see Jeff Masters' blog. To get serious discussions of worst-case scenario thinking, see Bruce Schneier's blog. To get enough Vitamin D, don't read any blogs and go outside instead.", "img": "https://imgs.xkcd.com/comics/worst_case_scenario.png", "title": "Worst-Case Scenario", "day": "2"}