{"month": "9", "num": 792, "link": "", "year": "2010", "news": "", "safe_title": "Password Reuse", "transcript": "[[A man is sitting facing a computer, Hat man is standing behind him.]]\nHat man: Password entropy is rarely relevant. The real modern danger is password reuse. \nMan: How so? \n(Computer: Password too weak.)\n\n[[Close up on just Hat man.]]\nHat man: Set up a web service to do something simple, like image hosting or tweet syndication, so a few million people set up free accounts.\n\n[[The man has now turned his chair around to face Hat man.]]\nHat man: Bam, you've got a few million emails, default usernames, and passwords.\n\n[[Just Hat man.]]\nHat man: Tons of people use one password, strong or not, for most accounts.\n\nUse the list and some proxies to try automated logins to the 20 or 30 most popular sites, plus banks and payola and such.\n[[A piece of paper containing a list with three columns, titled 'Email', 'User', and 'Pass'. An arrow branching out from the paper to the words 'Banks', 'Facebook', 'Gmail', 'Paypal', and 'Twitter'.\n\n[[Hat man is still standing facing the man in the chair, who now puts his hand to his chin.]]\nHat man: You've now got a few hundred thousand real identities on a few dozen services, and nobody suspects a thing.\nMan: And then what?\n\n[[The same as previous panel, further back.]]\nHat man: Well, that's where I got suck.\nMan: You DID this?\nHat man: Why did you \nthink\n I hosted so many unprofitable web services?\n\n[[Close-up on Hat man.]]\nHat man: I could probably net a lot of money, one way or another, if I did things carefully. But research shows more money doesn't make people happier, once they make enough to avoid day-to-day financial stress.\n\n[[Another close-up, facing opposite direction.]]\nHat man: I could mess with people endlessly, but I do that already. I could get a political or religious idea out to most of the world, but since March of 1997 I don't really believe in anything.\n\n[[Hat man facing man in chair again.]]\nHat man: So, here I sit, a puppetmaster who wants nothing from his puppets. -- It's the same problem Google has.\nMan: Oh?\n\n((This panel is indented.))\nGoogle\u0085\n[[A man stands, his chair behind him, leaning his hands on the edge of a boardroom table with the Google logo on it. Behind it sit a woman with a bun and glasses and another man.]]\nMan: Okay, everyone, we control the world's information. Now it's time to turn evil. What's the plan?\nWoman: Make boatloads of money?\n\n[[The man stands with his hand on his head.]]\nMan: We already do!\nVoice off-screen: Set up a companywide CoD4: Modern Warfare tournament each week?\nMan: \nThat's not evil!\n\nVoice: Ooh, dibs on the lobby TV!\nMan: Okay, we \nsuck\n at this.\n\n{{Title text: It'll be hilarious the first few times this happens.}}", "alt": "It'll be hilarious the first few times this happens.", "img": "https://imgs.xkcd.com/comics/password_reuse.png", "title": "Password Reuse", "day": "13"}