{"month": "10", "num": 802, "link": "https://xkcd.com/802_large/", "year": "2010", "news": "Full view <a href=\"https://xkcd.com/802_large/\">here</a>, poster <a href=\"https://store.xkcd.com/products/online-communities-poster\">here</a>. Note: while I was working on this,<br />Ethan Bloch posted <a href=\"https://web.archive.org/web/20120111133638/https://www.flowtown.com/blog/the-2010-social-networking-map\">his own update</a> of <a href=\"https://xkcd.com/256/\">my 2007 map</a>. Check it out, too!", "safe_title": "Online Communities 2", "transcript": "[[A giant, untranscribable map of the internet. Apologies from the transcriber, who did her best to include as much as she could without going nuts.]]\n\n((Label in the center of main map.))\nUpdated Map of Online Communities\nSize on map represents volume of Daily Social activity (posts, chat, etc). Based on data gathered over the \nSpring and Summer of 2010\n\n[[Two insets on the upper left-hand corner shows that this map is a tiny portion of the huge continent of Spoken Language, encompassing portions of the Internet, Email, and Cell Phones (SMS).]]\n\n[[The largest landmass on the map by far, which takes up nearly the entire northern half of the map is \"Facebook\" -- with large states in the southeast of the country labeled 'Farmville' and 'Happy Farm'. There is a much smaller state to the west of these called 'Farm Town'. To the north of these states is a large swath of unremarkable land entitled 'Northern Wasteland of Unread Updates.' This is directly north of the large Dopamine Sea.\n\nA peninsula on the southwest, just below the Plains of Awkwardly Public Family Interactions, houses many tiny states, such as MySpace, Orkut, LinkedIn, Bebo, & Hi5. It is bordered on the south by Buzzword Bay, which contains several islands of varying sizes. Among these are YouTube and Twitter (the largest), which are separated by the Social Media Consultant Channel. To the southeast of Twitter, across the Sea of Protocol Confusion, is another, equally large island. Most of it is Skype, with the north having two largish states called AIM and Windows Live Messenger. On the southwest part of the island are two smaller states called GG and Yahoo Messenger.\n\nThe Island of Skype is extremely close to, but separated by the Great Firewall (a dashed line), the large landmass of QQ. It's north shore is the Gulf of China and Grass Mud Horse Bay. Outside of these bays, over the Great Firewall are two islands called Craigslist and 2Channel.\n\nIn the Dopamine Sea, off the southern shores of Farmvile and Happy Farm, is MMO Isle. Its largest state is WoW, with Runescape, Lineage, Maple Story, Habbo, and the Mountains of Steam among its notable landmarks. To the southeast of the island is the Gulf of Lag, in which sits the CDC Games island, with Eve Online.\n\nTo the east of Twitter is Troll Bay, with such islands as Reddit and Reddit, Digg, Stumbleupon, Delicio.us, and Wikipedia Talk Pages. To their south are the IRC isles, of which one is the tiny island of #xkcd.\n\nEast of these islands, and north of Skype island, is the Sea of Memes. In this sea, to the north of Craigslist and 2Channel, is an archipelago of tiny islands. There is an inset, labeled 'Forums.' (See below.)\n\nTo the southwest if Twitter island, in the Sea of Opinions, are the blog islands. These lie south of the islands in Buzzword Bay, as well. The northernmost islands in this group are centered around the Bay of Drama, on which can be found Diary Blogs, Gossip Blogs, and Livejournal. Gossip Blogs share an island with Political, Music, and Tech Blogs. To the north of this island is a smaller island called Photo Blogs. South of Diary Blogs, and off the southwest coast of Music blogs is a smaller island called Fandom Blogs. South of Tech Blogs, off of which sprouts the small peninsula of Business Blogs, is the Spamblog Straits. On the other side of the straits is a large island made up of Miscellaneous Blogs, with two states demarcated as Religious Blogs and Blog Blogs. Southwest of the Blog Islands is the Sea of Zero (0) Comments.]]\n\n[[An inset of a group of islands in the sea of memes located on the lower right corner of the map, labeled 'Forums'. The largest by far is 4chan and \nb\n. Also found here are D2JSP, JLA Frums, Fan Forum, Something Awful, and many smaller ones, too numerous to list here.]]\n\n[[The northeastern third of Gossip\nPolitical\nTech Blogs island is another inset labeled 'Blogosphere (Core)'. This can be found on the lower left corner of the map. Two peninsulas in Political Blogs bookend the Bay of Flame -- these are Liberal Blogs and Conservative Blogs. Between them lie several tiny islands such as Politics Daily, CNN Politcal Ticker, and Mediaite. Off the coast of Liberal Blogs lies the island of NYTimes, off the coast of Conservative Blogs is Libertarian Isle. Between the two lies The Talk. The northern peninsula of Tech Blogs contains places such as Gizmodo, Engadget, Joystiq, and Kotaku.]] \n\n((Text found between the two insets, which are directly below the main map.))\nABOUT THIS MAP\nCommunities rise and fall, and total membership numbers are no longer a good measure of a community's current size and health. This updated map uses size to represent total social activity in a community -- that is, how much talking, playing sharing, or other socializing happens there. This meant some paring of apples and oranges, but I did my best and tried to be consistent.\n\nEstimates are based on the numbers I could find, but involved a great deal of guesswork, statistical inference, random sampling, nonrandom sampling, a 20,000-cell spreadsheet, emailing, cajoling, tea-leafing reading, goat sacrifices, and gut instinct (i.e. making things up).\n\nSources of data include Google and Bing, Wiipedia, Alexa, Big-Boards.com, StumbleUpon, Wordpress, Akismet, every website statistics page I could find, press releases, news articles, and individual site employees. Thanks in particular to folks at Last.fm, LiveJournal, Reddit, and the New York Times, as well as sysadmins at a number of sites who shared statistics on condition of anonymity.\n\n{{Title text: Best trivia I learned while working on this: 'Man, Farmville is so huge! Do you realize it's the second-biggest browser-based social-networking-centered farming game in the WORLD?' Then you wait for the listener to do a double-take.}}", "alt": "Best trivia I learned while working on this: 'Man, Farmville is so huge! Do you realize it's the second-biggest browser-based social-networking-centered farming game in the WORLD?' Then you wait for the listener to do a double-take.", "img": "https://imgs.xkcd.com/comics/online_communities_2.png", "title": "Online Communities 2", "day": "6"}