{"month": "11", "num": 819, "link": "", "year": "2010", "news": "", "safe_title": "Five-Minute Comics: Part 1", "transcript": "Because of a family illness, instead of regular comics, this week I'll be sharing some strips that I drew as part of a game I played with friends. Each comic had to be written and drawn in five minutes. -- Randall\n\n----Comic #1----\n[[A man and a woman stand facing each other.]]\nMan: Jupiter will make its closest approach to Earth in decades.\n\n[[The man points behind the woman, and the woman turns around.]]\nMan: In fact, here it comes now!\n\n[[Jupiter, about the size of the characters' heads, hovers into the frame at about head-height.]]\nJupiter: Hey, guys.\n\n[[Jupiter continues to hover through the frame as the characters watch it go.]]\nJupiter: Anyone need a gravitational slingshot?\nWoman: No, I'm good.\nJupiter: Aight.\n\n----Comic #2----\n[[A man sits on a box, playing a guitar.]]\nMan: ...Now I don't blame him 'cause he ran and hid, -- but the meanest thing that he ever did -- was before he left, he went and named me \"Trig.\"\n\n----Comic #3----\n[[A man looks down a well.]]\nMan: Oh God, a little girl is trapped down this well!\n\n[[The man runs off screen.]]\n\n[[He returns, leading a pony.]]\nMan: It's okay, we got you that pony you always wanted!\n\n[[He tries to cram the pony down the well with the aid of a large stick.]]\nMan: Get... in... there... -- Ugh!\n\n----Comic #4----\n[[A man and a woman stand in a server room.]]\nMan: I like to get back to nature by coming out here to the server room. -- The warmth, the whirr of the drives, the drone of the fans, the howl of the wolves...\nWoman: Wolves?\nMan: Yeah, we started a reintroduction program.\n\n----Comic #5----\n[[A man stands by himself in the frame.]]\nMan: Yo momma's so masculine that she... oh, wait, that's your dad. -- Is your mom the lady over by the door? Aww, she looks nice!\n\n----Comic #6----\n[[A man runs toward another man who is wearing a powdered wig, holding a gun in one hand, and a flute in the other. Behind him, someone is chasing him on a motorcycle.]]\nMan: Bach, activate the magic flute and teleport us home! Wagner's right behind me on his Ring Cycle!\n\n----Comic #7----\nHotness Ratings:\n[[A close up of a woman with wavy hair.]]\nIncredily made-up girl on magazine cover.\n((Inset of a man: \"Meh.\"\n\n[[An average girl.]]\nGirl in your bio class.\n((Inset of man: \"Two stars.\"))\n\n[[Girl with mussed hair in over-sized men's shirt.]]\nGirl in your bio class wearing one of your shirts.\nGirl: Want some breakfast?\n((Inset man: \"Four stars.\"\n\n[[Girl with another sort of shirt speaking to an older lady.]]\nGirl in your bio class wearing one of your mom's shirts.\nGirl: Thanks for the great night.\n((Inset man: \"Wat!\"))\n\n[[Creepy-looking girl.]]\nGirl in your bio class wearing your mom's skin like a suit.\nGirl: Give Mommy a hug!\n((Inset man, screaming: \"AAAAAAAA\"))\n\n{{Title text: The wolves thin the RAID arrays, removing the slowest and weakest disks to keep the average seek speed high.}}", "alt": "The wolves thin the RAID arrays, removing the slowest and weakest disks to keep the average seek speed high.", "img": "https://imgs.xkcd.com/comics/five_minute_comics_part_1.png", "title": "Five-Minute Comics: Part 1", "day": "15"}