{"month": "11", "num": 820, "link": "", "year": "2010", "news": "", "safe_title": "Five-Minute Comics: Part 2", "transcript": "Because of a family illness, instead of regular comics, this week I'll be sharing some strips that I drew as part of a game I played with friends.  Each comic had to be written and drawn in five minutes.\n\n    -- Randall\n\n((A series of comics are arrayed haphazardly.  They will be tackled top to bottom, left to right, approximately.  Strips will be separated by two new lines.))\n\n[[A ninja is hiding under a diving board as a man runs along it.]]\n\n[[The man jumps on the end of the board and hits the ninja in the head, knocking him into the pool.]]\n\n[[The ninja floats in the water.  A bullet passes through the man's head.]]\n<<thwipp>>\n\n[[The man is lying bleeding on the diving board, the ninja is still unconscious on the pool.]]\n\n[[A sniper is at the top of a hill.  The sign in front of the hill says \"Grassy Knoll\".]]\n\n[[Someone is pointing at the diagram of the previous panel.]]\nOff-panel voice: Wait, so \nwhat\n does this have to do with 9\n11, again?\nPerson: I \nsaid\n I'm \ngetting\n there!\n\n\n[[A man is studying a woman.]]\nMan: You look different.\n\nMan: You have this... _glow_ about you.\n\n[[They stare in silence.]]\n\n[[A baby falls out of the woman.]]\n<<plop>>\n\n\nWoman: Cogito ergo cogito.\nOff-panel voice: Playing it safe, huh?\n\n\n[[Two ghosts are standing in front of a woman at a door, each carrying a bag.  They are children dressed up.]]\nChildren: Trick or treat!\n\n[[The woman doesn't move.]]\n\nChild: Um hi.  Why are you just standing there?\nOther Child: Candy?\n\n[[Another silent panel as the children stare up at the woman.]]\n\n[[The second child looks in their bag.]]\nOther Child: Oh God, my bag of candy.\n\nOther Child: It's filling with blood.\nChild: We should go.\n\n\n[[A jet is flying across the panel.]]\nPilot: Bail out! Bail out! Bail out!\n\n[[The pilot and copilot have buckets, and are bailing water out of the cockpit.]]\n\n\nThe following is a dramatization of real events.\n\n[[A person is at a counter, with several jars.]]\nPerson: AAAAAAAAAAAAA I'm making a sandwich! AAAAAAAAAA!\n\n\n[[Two people are carrying lightsabers and wearing robes.]]\nPerson: Oh God.  My eyes won't focus right! And your robe looks... really dirty!\n\nMy blacklightsaber was not a success.\n\n\n[[A person is standing.]]\nPerson: Ladies and gentlemen of the jury.\nOff-screen voice: It seems we happen to be all ladies, actually.\nPerson: ... in that case, this defense is going to appear _extremely_ ill-advised.\n\n\n[[Darth Vader is sitting between two people, at a table.]]\nPerson: Your sad devotion to that ancient religion hasn't hleped you conjur up the stolen data tapes, or given you --\nDarth Vader: \nHey.\n  Wicca is a legitimate belief system!\n\n[[Darth Vader is drawing a pentagram on the table.]]\nPerson: What are you --\nDarth Vader: Putting a _hex_ on your family.\n\n{{Title text: Dear Wiccan readers: I understand modern Wiccans are not usually all about the curses and hexes. But Darth Vader was recently converted from Episcopalianism and he's still figuring it all out.}}", "alt": "Dear Wiccan readers: I understand modern Wiccans are not usually all about the curses and hexes. But Darth Vader was recently converted from Episcopalianism and he's still figuring it all out.", "img": "https://imgs.xkcd.com/comics/five_minute_comics_part_2.png", "title": "Five-Minute Comics: Part 2", "day": "17"}