{"month": "11", "num": 821, "link": "", "year": "2010", "news": "", "safe_title": "Five-Minute Comics: Part 3", "transcript": "Because of a family illness, instead of regular comics, this week I'll be sharing some strips that I drew as part of a game I played with friends.  Each comic had to be written and drawn in five minutes.\n\n    -- Randall\n\n(( The individual comics are arranged haphazardly.  Once again they will be separated by double newlines, while panels will be separated by single newlines.))\n\nPearl Harbor. November 7th, 1941.\n[[There is a beach, with some ships floating in a crescent shaped harbor.]]\n\n[[The same bay, again.]]\n\n[[The boats continue to move about the harbor.]]\n\n[[The boats do their thing.  A title explains.]]\n(We're going to be here a while, since the attack wasn't until December.)\n\n\n[[A man is sittin gon a bus, a woman in front of him.]]\nI know it's natural and all, but I really wish women on the bus wouldn't try to breastfeed me.\nWoman: C'mon, have some milk. Right here.\nMe: I'm \nreading.\n\n\n\ns\nI think that\nI saw a study once that said that\ng\nInstant persuasiveness multiplier!\n\n\n[[A newspaper front page.  Billy Joel is between two policemen.]]\nTimes\nBilly Joel Arrested for Arson\n\n\n[[One person has a cord leaving their mouth, the other is holding a handset on the end of it to their ear.]]\nHandset: Hee hee hee... *giggle*\nI hear that if you drink coke and eat pop rocks, you vomit up a corded telepohen handset on which you hear creepy little girls giggling.\n\n\n[[Three soldiers are holding a large integral sign, while a fourth points a gun at the Little Rock High School.]]\n1957: Eisenhower orders the military to integrate Little Rock High School.\n\n\n[[A smartphone is vibrating across a table, towards a person.]]\nThe smartphones got \ntoo\n smart... and developed a taste... for BLOOD!\nFortunately, the only way they could move was by turning on their vibrate while on a sloped table.\n\n\n[[A person is reading to their child.]]\nPerson: And the wolf went to see the 38th little pig, who had built his house out of strontium.\nPerson: And the wolf was all, \"Ok, what is \nwith\n this shit?\"\nThe 119 Little Pigs\n\n\n[[Someone is holding up a gun.]]\nPerson: Fastest gun in the west!\n\n[[The gun is galloping across the desert.]]\n<<gallop>> <<gallop>>\n\n[[There is a podium, with a gun in each position.]]\nWinner!\n\n\n[[A picture of a centrifuge dominates the panel.]]\nCentrifuges:\nThey're what separate the men from the boys.\n\n\n[[A computer monitor is plugged in, and cables run into a closet.]]\nLucy: Time passes differenly in Narnia, so by putting the CPU and storage for my machine there, I was able to run through the Folding@Home and Seti@Home databases in about an hour.\nPeter: There are _so_ many problems with that.\n\n\n[[Someone is talking to Alice.]]\nPerson: One of these days, Alice... Wham, zoom, sploosh, fwoom, splash, gurlle, wheeeee, fwoosh, aren't waterslides fun?!\n\n{{Title text: Resulting in The Little Rock 9x + C.}}", "alt": "Resulting in The Little Rock 9x + C.", "img": "https://imgs.xkcd.com/comics/five_minute_comics_part_3.png", "title": "Five-Minute Comics: Part 3", "day": "19"}