{"month": "4", "num": 882, "link": "", "year": "2011", "news": "", "safe_title": "Significant", "transcript": "[[Person with a pony tail runs up to another person, who subsequently points off-panel where there are presumably scientists.]]\nPonytail: Jelly beans cause acne!\nAnother: Scientists! Investigate!\nScientists: But we're playing Minecraft!\nScientists: ... Fine.\n\n[[Two scientists.  One has safety goggles, the other has a sheet of notes.]]\nGoggles: We found no link between jelly beans and acne (p > 0.05).\n\n[[Back to the original two.]]\nAnother: That settles that.\nPonytail: I hear it's only a certain color that causes it.\nAnother: Scientists!\nScientists:  But Miiiinecraft!\n\n[[20 near identical small panels follow, 4 rows 5 columns.]]\nGoggles: We found no link between purple jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between brown jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between pink jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between blue jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between teal jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between salmon jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between red jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between turquoise jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between magenta jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between yellow jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between grey jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between tan jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between cyan jelly beans and acne (p > 0.05).\n\nGoggles: We found a link between green jelly beans and acne (p < 0.05).\nOff-panel: WHOA!\n\nGoggles: We found no link between yellow jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between beige jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between lilac jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between black jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between peach jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between orange jelly beans and acne (p > 0.05).\n\n[[Newspaper front page.]]\nNEWS\nGreen Jelly Beans Linked To Acne!\n95% Confidence\n[[There is a picture of 3 green jelly beans.]]\nOnly 5% chance of coincidence!\n  Scientists...\n\n{{Title text: 'So, uh, we did the green study again and got no link. It was probably a--' 'RESEARCH CONFLICTED ON GREEN JELLY BEAN\nACNE LINK; MORE STUDY RECOMMENDED!'}}", "alt": "'So, uh, we did the green study again and got no link. It was probably a--' 'RESEARCH CONFLICTED ON GREEN JELLY BEAN/ACNE LINK; MORE STUDY RECOMMENDED!'", "img": "https://imgs.xkcd.com/comics/significant.png", "title": "Significant", "day": "6"}