{"month": "7", "num": 921, "link": "", "year": "2011", "news": "", "safe_title": "Delivery Notification", "transcript": "[[The first panel is a UPS InfoNotice(r).  Most of the text on it is just scribbles, though the company logo and header is clear.]]\n\n[[A person opens their door to see the InfoNotice(r).  From off panel, a second person reacts.]]\nPerson:  \nWhat!\n  I've been here all day!\nOff-panel person 2: Huh?\nPerson: They have my laptop.\n\n[[Now both people are visible.  The first is making an expansive gesture of annoyance.]]\nPerson 2: So get it tomorrow.\nPerson: I fly out in the morning and they don't open till noon!\nPerson 2: Sucks.\n\n[[The first person is at a laptop.  The second is once again off-panel.]]\nPerson: It's \nright there\n.  I can see the UPS building on the map.\nOff-panel person 2: Ok...\n\n[[Dramatic zoom to the person's upper torso and face, along with clenched fist.]]\nPerson: My laptop is there.  It's \nmine\n.\nPerson: I'm going to get it.\n\n[[Even more dramatic zoom!  The person's featureless face fills the panel.]]\nOff-panel person 2: They won't let you.\nPerson: Who are they to keep from me what is mine?\nOff-panel person 2: Dude, they --\n\n[[The person spins, raising a finger, most likely to indicate some sort of quest at hand.]]\nPerson: A quest is at hand!\nOff-panel person 2: Security's gonna throw you out.\nPerson: I fear neither death nor pain.  But I will not go unarmed.\n\n((Three inset panels overlap, in a montage format.  The person narrates.))\n[[Elves in long robes stand around a table, on which lies a broken sword.]]\nNarrating person: Light the beacons and send word to the Elves.  They must reforge the sword of my fathers.\n\n[[An Elf beats the sword together on an anvil.]]\n\n[[An Elf rides a horse, silhouetted by the full moon.]]\nNarrating person: Ere dawn, I will go forth to the Sorting Depot.\n\n((The montage ends and normal panels resume.))\n[[The Elf knocks at the door, sword in scabbard held under arm.]]\n<<Knock knock knock knock>>\n\n[[The person opens the door, to find a second InfoNotice(r) stuck on top of the first.  The Elf is gone.]]\n\n{{Title text: You can arrange a pickup of your sword in Rivendell between the hours of noon and 7:00 PM.}}", "alt": "You can arrange a pickup of your sword in Rivendell between the hours of noon and 7:00 PM.", "img": "https://imgs.xkcd.com/comics/delivery_notification.png", "title": "Delivery Notification", "day": "6"}