{"month": "8", "num": 936, "link": "", "year": "2011", "news": "", "safe_title": "Password Strength", "transcript": "((The comic illustrates the relative strength of passwords assuming basic knowledge of the system used to generate them. A set of boxes is used to indicate how many bits of entropy a section of the password provides. The comic is laid out with 6 panels arranged in a 3x2 grid. On each row, the first panel explains the breakdown of a password, the second panel shows how long it would take for a computer to guess, and the third panel provides an example scene showing someone trying to remember the password.))\n\n[[The password \"Tr0ub4dor&3\" is shown in the centre of the panel. A line from each annotation indicates the word section the comment applies to.]]\nUncommon (non-gibberish) base word [[Highlighting the base word - 16 bits of entropy.]]\nCaps? [[Highlighting the first letter - 1 bit of entropy.]]\nCommon Substitutions [[Highlighting the letters 'a' (substituted by '4') and both 'o's (the first of which is substituted by '0') - 3 bits of entropy.]]\nPunctuation [[Highlighting the symbol appended to the word - 4 bits of entropy.]]\nNumeral [[Highlighting the number appended to the word - 3 bits of entropy.]]\nOrder unknown [[Highlighting the appended characters - 1 bit of entropy.]]\n(You can add a few more bits to account for the fact that this is only one of a few common formats.)\n\n~28 bits of entropy\n2^28 = 3 days at 1000 guesses\nsec\n(Plausible attack on a weak remote web service. Yes, cracking a stolen hash is faster, but it's not what the average user should worry about.)\nDifficulty to guess: Easy.\n\n[[A person stands scratching their head trying to remember the password.]]\nPerson: Was it trombone? No, Troubador. And one of the Os was a zero?\nPerson: And there was some symbol...\nDifficulty to remember: Hard.\n\n[[The passphrase \"correct horse battery staple\" is shown in the centre of the panel.]]\nFour random common words {{Each word has 11 bits of entropy.}}\n\n~44 bits of entropy.\n2^44 = 550 years at 1000 guesses\nsec\nDifficulty to guess: Hard.\n\n[[A person is thinking, in their thought bubble a horse is standing to one side talking to an off-screen observer. An arrow points to a staple attached to the side of a battery.]]\nHorse: That's a battery staple.\nObserver: Correct!\nDifficulty to remember: You've already memorized it\n\n((The caption below the comic reads: Through 20 years of effort, we've successfully trained everyone to use passwords that are hard for humans to remember, but easy for computers to guess.))\n\n{{Title text: To anyone who understands information theory and security and is in an infuriating argument with someone who does not (possibly involving mixed case), I sincerely apologize.}}", "alt": "To anyone who understands information theory and security and is in an infuriating argument with someone who does not (possibly involving mixed case), I sincerely apologize.", "img": "https://imgs.xkcd.com/comics/password_strength.png", "title": "Password Strength", "day": "10"}