{"month": "8", "num": 941, "link": "", "year": "2011", "news": "", "safe_title": "Depth Perception", "transcript": "((The comic is narrated by an unspecified person. All dialog is shown in boxes overlaid on the comic panels.))\n\n[[The panel background looks like a cloudy sky, with the clouds all running together and appearing as a blue\ngrey smear.]]\nI've always had trouble with the size of clouds.\nI \nknow\n they're huge. I can see their shapes.\nBut I don't really see them as objects on the same scale as trees and buildings.\nThey're a backdrop.\n\n[[A person stands on a flat disk inside a hemispherical dome with the front half cut away. The dome is labelled \"Sky\", and the disk is labelled \"Ground\". The dome is about twice as tall as the person.]]\nStars are the same way.\n\nI know they're scattered through and endless ocean, but my gut insists they're a painting on a domed ceiling.\n\n((The next two lines of dialog are stretched over the following three panels.))\n[[A person stands on a curved surface, looking up.]]\nIf I try hard enough, I get a glimmer of depth, a dizzying sense of space,\n\n[[The perspective of the scene shifts, suddenly the surface the person was standing on is in the top left of the panel. The person is now looking down, leaning back, and waving their arms trying to regain balance.]]\nBut then everything snaps back.\n\n[[The perspective of the scene returns to normal, the person is now semi-crouched, staring at the ground with legs spaced apart to help them balance.]]\n\n[[An american football field is shown, with sections at the tips of the goal posts highlighted and shown as a zoomed view in an insert box. The goal posts each have a webcam mounted on top of them.]]\nSo one summer afternoon\nI set up two HD webcams hundreds of feet apart,\nPointed them at the sky,\n\n((The next two lines of dialog are stretched over two panels each.))\n[[The first panel shows a pair of glasses with the note \"Very strong reading glasses.\" and a smartphone with an attachment designed to clip onto the glasses. The smartphone screen is setup to display two images side by side such that one camera is visible in the left half of the screen, and the other camera is visible in the right half of the screen.]]\nAnd fed one stream to each of my eyes.\n\n[[The next panel shows the completed phone\nglasses assembly.]]\nThe parallax expanded my depth perception by a thousand times,\n\n[[The person stands wearing the phone\nglasses assembly, staring into the sky.]]\nAnd I stood in my living room\nAt the bottom of an abyss\n\n[[The person now stands on the shore of an unidentified coastline (possibly Boston?), a city is near their right foot and the tallest skyscraper appears ankle high. A mountain range is behind them that is also barely ankle high. The person is standing with their head well above cloud level as clouds swim around them.]]\nWatching mountains drift by.\n\n{{Title text: I've looked at clouds from both sides now.}}", "alt": "I've looked at clouds from both sides now.", "img": "https://imgs.xkcd.com/comics/depth_perception.png", "title": "Depth Perception", "day": "22"}