{"month": "9", "num": 954, "link": "", "year": "2011", "news": "", "safe_title": "Chin-Up Bar", "transcript": "[[Hat man is standing on an escalator as it ascends. He is carrying a pole with what looks like a bracket on each end, resting on his shoulder. In front of him is a punk with spiked hair and a girl with her hair in a ponytail. Behind him is a featureless person and a man wearing glasses with a goatee standing next to someone with short hair.]]\n\n[[The view closes on hat man and the person behind him. In the background a girl can be seen standing on the descending escalator.]]\nPerson: This is a long escalator.\nHat man: 70 meters. Longest in the country.\n\n[[The view opens a bit wider. In the background the girl from the last panel has now passed the group and a few other people can be seen descending.]]\n\nPerson: Why're you carrying a chin-up bar?\nHat man: Why aren't you wearing a hat?\n\n[[The view opens up to show the same people in the first panel. They're near the top of the escalator now and the girl with the ponytail is beginning to step off.]]\nPerson: Seriously, why did you bring it?\nHat man: How should I know? I'm not a psychologist.\n\n[[As hat man steps off the escalator he turns and installs the chin-up bar such that it blocks people from leaving the escalator. The person talking to him turns to observe what hat man is doing.]]\n<<Twist>>\n<<Click click>>\n\n[[They get onto the descending escalator. The man with glasses and a goatee and his companion are blocked from leaving the escalator by the chin-up bar.]]\n\n((The next panel is the size of 6 regular panels combined.))\n[[The view shows an extended section of the escalator, the top right has become a pile of people all squished together and on top of each other. One person has grabbed another by the hair and is standing on a third person in an attempt to not fall. Someone is falling off the pile and another person is running down the escalator to avoid them. People closer to the bottom of the escalator are looking horrified at the scene ahead of them. In the background hat man and his companion are visible. Hat man is looking toward the bottom of the escalator, not caring or noticing the chaos unfolding. His companion looks back pensively.]]\n\n{{Title text: Those few who escaped found the emergency cutoff box disabled. The stampede lasted two hours and reached the bottom three times.}}", "alt": "Those few who escaped found the emergency cutoff box disabled. The stampede lasted two hours and reached the bottom three times.", "img": "https://imgs.xkcd.com/comics/chin_up_bar.png", "title": "Chin-Up Bar", "day": "21"}