{"month": "10", "num": 960, "link": "", "year": "2011", "news": "", "safe_title": "Subliminal", "transcript": "[[Two people are gathered around a computer. A person is seated interacting with the computer while another stands behind them with an arm resting on the back of the chair.]]\nPerson 1 (seated): What hidden arrow?\nPerson 2 (standing): I thought everyone knew about it. Pull up the FedEx logo.\n<<Click>>\n\n[[The second person is now pointing at the screen.]]\nPerson 1: Where is it?\nPerson 2: Right there. Look at the whitespace.\nPerson 1: I don't see it.\n\n[[The next panel shows a stylised view of the FedEx logo. The white space above the 'ed' in Fed is decorated to look like a tank turret with the barrel extending into the letter 'F'. Along the bottom of the letters a baseball player with the number 24 on his back is reaching out to catch a baseball. The baseball is forming the centre of the 'e' while the arm provides the break for the tail. The baseballers head marks the centre of the 'd' and the number 24 is coloured in blue to show the lower half of the stroke of the 'd'. Toward the right of the image the space between the 'E' and 'x' has been decorated to look like a Guy Fawkes mask, with ties wrapping around the 'x' and being drawn off-screen. A faint outline suggests the whitespace above the 'x' is a hat, with the brim extending into the upper part of the 'E'. Two speech bubbles are visible above the drawing, both spoken by off-screen characters.]]\nPerson 1 (off-screen): All I see if Guy Fawkes watching Willie Mays catch a fly ball while an armored assault vehicle rolls past.\nPerson 2 (off-screen): ...You either need more medication or less. Not sure which.\n\n{{Title text: Once you see it, you can't help seeing it every time. Until your body finishes metabolizing the mushrooms.}}", "alt": "Once you see it, you can't help seeing it every time. Until your body finishes metabolizing the mushrooms.", "img": "https://imgs.xkcd.com/comics/subliminal.png", "title": "Subliminal", "day": "5"}