{"month": "11", "num": 977, "link": "", "year": "2011", "news": "It turns out Monday was Steve Waterman's birthday. His <a href=\"https://www.watermanpolyhedron.com/\">site</a> has posters<br />of his map, plus maybe the world's only Winkel Tripel-critiquing poetry.", "safe_title": "Map Projections", "transcript": "((The comic is one large panel, with different types of map projections listed in two columns. Each listing has an illustration of that projection plus a short paragraph describing the individual who prefers that projection.))\n\nWhat your favourite Map Projection says about you.\n\nMercator\n[[A drawing of the Mercator projection is shown. In this the world is distorted to fit into a perfect square, centred on Africa.]]\nYou're not really into maps.\n\nRobinson\n[[A drawing of the Robinson projection is shown. Areas near the poles in this projection are fairly distorted, but the distortion is greatly reduced when moving toward the equator.]]\nYou have a comfortable pair of running shoes that you wear everywhere. You like coffee and enjoy the Beatles. You think the Robinson is the best-looking projection, hands down.\n\nWinkel-Tripel\n[[The Winkel-Tripel projection is similar to the Robinson projection, with less distortion at the poles. However the distortion at equivalent latitudes differs as the longitude varies.]]\nNational Geographic adopted the Winkel-Tripel in 1998, but you've been a W-T fan since \nlong\n before \"Nat Geo\" showed up. You're worried it's getting played out, and are thinking of switching to the Kavrayskiy. You once left a party in disgust when a guest showed up wearing shoes with toes. Your favourite musical genre is \"post-\".\n\nHobo-Dyer\n[[The Hobo-Dyer projection is a cylindrical projection resulting in significant latitudinal distortion. The result is a rectangular image with the poles vertically compressed, and land near the equator stretched.]]\nYou want to avoid cultural imperialism but you've heard bad things about Gall-Peters. You're conflict-averse and buy organic.l You use a recently-invented set of gender-neutral pronouns and think that what the world needs is a revolution in consciousness.\n\nA globe!\n[[It's a globe.]]\nYes, you're very clever.\n\nPierce Quincuncial\n[[This is a square projection centred over the north pole. The continents stretch out radially from the centre of the map and bits of Antarctica are visible in each corner of the projection.]]\nYou think that when we look at a map, what we really see is ourselves. After you first saw \nInception\n, you sat silent in the theater for six hours. It freaks you out to realise that everyone around you has a skeleton inside them. You \nhave\n really looked at your hands.\n\n((The second column of projections starts here.))\n\nVan Der Grinten\n[[This projection displays the continents inside a perfectly circular frame. The continents are displayed with similar distortion to what you would see in the Robinson or Winkel-Tripel projections.]]\nYou're not a complicated person. You love the Mercator projection; you just wish it weren't so square. The earth's not a square, it's a circle. You like circles. Today is gonna be a good day!\n\nDymaxion\n[[The Dymaxion projection attempts to unfold the earth into a polyhedral net, centred on the north pole. The map has no set shape, instead it looks to be made out of a series of triangles.]]\nYou like Isaac Asimov, XML, and shoes with toes. You think the segway got a bad rap. You own 3D goggles, which you use to view rotating models of better 3D goggles. You type in Dvorak.\n\nGoode Homolosine\n[[The Goode Homolosine projection attempts to minimise distortion by combining two equal area projections onto a split projection. The map resembles a smooth unfolded net, with landmasses kept whole where possible.]]\nThey say mapping the earth on a 2D surface is like flattening an orange peel, which seems easy enough to you. You like easy solutions. You think we wouldn't have so many problems if we'd just elect \nnormal\n people to congress instead of politicians. You think airlines should just buy food from the restaurants near the gates and serve \nthat\n on board. You change your car's oil, but secretly wonder if you really \nneed\n to.\n\nPlate Carrée\n(Equirectangular)\n[[This projection maps latitude and longitude to a rectangular grid, leading to significant longitudinal distortion near the poles.]]\nYou think this one is fine. You like how \nx\n and \ny\n map to latitude and longitude. The other projections overcomplicate things. You want me to stop asking about maps so you can enjoy dinner.\n\nWaterman Butterfly\n[[This projection unfolds the world into a net, similar to the Dymaxion projection. It is centred on the Atlantic, and resembles a butterfly with the Americas on the western wing, with Europe and Africa on the eastern wing.]]\nReally? You know the Waterman? Have you seen the 1909 Cahill map it's based-- ...You have a framed reproduction at home?! Whoa. ...Listen, forget these questions. Are you doing anything tonight?\n\nGall-Peters\n[[Another rectangular projection, this map suffers significant distortion near the poles, and significant latitudinal distortion in general.]]\nI \nhate\n you.\n\n{{Title text: What's that? You think I don't like the Peters map because I'm uncomfortable with having my cultural assumptions challenged?  Are you sure you're not ... ::puts on sunglasses:: ... projecting?}}", "alt": "What's that? You think I don't like the Peters map because I'm uncomfortable with having my cultural assumptions challenged?  Are you sure you're not ... ::puts on sunglasses:: ... projecting?", "img": "https://imgs.xkcd.com/comics/map_projections.png", "title": "Map Projections", "day": "14"}