{"month": "12", "num": 992, "link": "", "year": "2011", "news": "", "safe_title": "Mnemonics", "transcript": "XKCD Presents: Some New Science Mnemonics\n\n((Pattern goes: \nSubject\nElements\nTraditional mnemonic\nContents of frame\nNew mnemonics))\n\nOrder of Operations\nParentheses, Exponents, Division & Multiplication, Addition & Subtraction\nTraditional: Please Excuse My Dear Aunt Sally\n[[Person having a shark delivered to his laptop]]\nPlease Email My Dad A Shark  \nor\nPeople Expect More Drugs And Sex\n\nSI Prefixes\nBig: Kilo, Mega, Giga, Tera, Peta, Exa, Zetta, Yotta\nMilli, Micro, Nano, Pico, Femto, Atto, Zepto, Yocto\n[[Graph of the declining profits of the Zune]]\n[[Karl Marx delivering a number of zeppelins to a bunch of confused proletariats]]\nBig: Karl Marx Gave The Proletariat Eleven Zeppelins, Yo\nSmall: Microsoft Made No Profit From Anyone's Zunes, Yo\n\nTaxonomy\nKingdom, Phylum, Class, Order, Family, Genus, Species\nTraditional: King Philip Came Over For Good Sex\nKaty Perry: I'm not sure who doubts this, really.\nKaty Perry Claims Orgasms Feel Good Sometimes\nor\nKernel Panics Crash Our Family Game System.\n\nGeologic Periods\n(Precambrian), Cambrian, Ordovician, Silurian, Devonian, Carboniferous, Permian, Triassic, Jurassic, Cretaceous, Paleogene, Neogene\nTraditional: [I never learned one]\n[[A month's set of birth control pills]]\nPolyCystic Ovarian Syndrome Does Cause Problems That Judicious Contraceptives Partially Negate\n\nResistor Color Codes\nBlack, Brown, Red, Orange, Yellow, Green, Blue, Violet, Gray, White\nTraditional: [none I care for]\n[[Glenn Beck holding the traditional \"Nanobot Vaccine Chemtrail 9\n11\" sign]]\n\"Big Brother Reptilian Overlords\", yelled Glenn, \"Brainwashing Via Ground water!!\"\nor\nBe Bold, Respect Others; You'll Gradually Become Versatile, Great Wikipedians!\n\nPlanets\nMercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune\nTraditional: My Very Excellent Mother Just Served Us Nachos\n[[A pregnant Mary attempting to explain things to an incredulous Joseph]]\nMary's \"Virgin\" Explanation Made Joseph Suspect Upstairs Neighbor.\n\n{{Title text: 'Sailor Moon's head exploded once' and 'Some men have explosive orgasms' both work for the Great Lakes from west to east (Paddle-to-the-Sea order).}}", "alt": "'Sailor Moon's head exploded once' and 'Some men have explosive orgasms' both work for the Great Lakes from west to east (Paddle-to-the-Sea order).", "img": "https://imgs.xkcd.com/comics/mnemonics.png", "title": "Mnemonics", "day": "19"}