{"month": "12", "num": 997, "link": "", "year": "2011", "news": "", "safe_title": "Wait Wait", "transcript": "Headlines!\nStockpiled in case Peter Sagal, host of NPR's Wait Wait Don't Tell Me, does something newsworthy in 2012.\n\n((Series of above-the-fold newspapers follows; Each has a headline, picture in most of them, and an explanation))\n\nWait Wait Don't Shoot Me\n[[A fierce Peter Sagal in a balaclava brandishes a gun in a supermarket]]\nNPR's Sagal in Whole Foods hostage standoff.\n\nWait Wait Don't Vote For Me\nPeter Sagal quits race for GOP top spot\n[[A sullen and defeated Peter Sagal surrounded by supporters admits defeat]]\n\nWait Wait Don't Judge Me\nSagal opens up about his Kermit fantasy.\n[[Stock profile images of Peter Sagal and Kermit the Frog]]\n\nWait Wait Don't Fire Me\n[[Stock profile image of Peter Sagal]]\nPeter Sagal let go after racist tirade.\n\nWait Wait Don't Cancel Me\nNPR axing news quiz.\n[[NPR spokesperson delivering announcement]]\n\nWait Wait Don't Interrupt Me\nSagal stabs Carl Kasell in on-air dispute.\n[[Peter Sagal mid-attack with a knife]]\n\nWait Wait Don't Look At Me\n[[Peter Sagal with a skin condition]]\nPeter Sagal's Poison Ivy Ordeal\nPeter Sagal: \"My 'Nam\"\n\nWait Wait Don't Friend Me\nPeter Sagal deletes his Facebook account.\n[[Person holding up a laptop with an \"Facebook account not found\" screen]]\n\nWait Wait Don't Seduce Me\nHow Lakshmi Singh stole Sagal's Heart.\n[[A wistful Lakshmi Singh being left by a sullen Peter Sagal]]\n\nWait Wait Don't Leave Me\n[[A wistful Peter Sagal being left by a furious Beth Sagal]]\nSagal's wife out after affair\n\nWait Wait Don't Spray Me\nPolice Raid Sagal's Occupy NPR protest\n[[Scummy policeman in riot gear spraying Peter Sagal in the face point blank with what is essentially a food product]]\n\nWait Wait Don't Indict Me\nSagal, five others named in cash-for-tote-bags scandal \n[[Peter Sagal doing a perp walk]]\n\nWait Wait Don't Clone Me\nPeter Sagal 'Outraged' over DNA harvesting.\n[[Fiery Peter Sagal, missing a small amount of DNA, at a podium]]\n\nWait Wait Don't Bust Me\nPeter Sagal's ghost captured\n[[Ghostbusters, careful not to cross the streams, capture the ghost of Peter Sagal]]\n\nWait Wait Don't Dissect Me\nSnoozing Sagal nearly snuffed in autopsy snafu\n[[Peter Sagal running away from from a very surprised pathologist]]\nPeter Sagal: \"I ain't dead!\"\n\nWait Wait Don't Objectify Me\nPeter Sagal is more than just a piece of meat\n\nWait Wait Don't Beatify Me\n[[Peter Sagal shakes his fist at a picture of the pope]]\nPeter Sagal Rebukes Pope\n\nWait Wait Don't Me\nPeter Sagal Accidentally\n[[Peter Sagal in a blank vacant]]\n\nWait Wait Don't Speak Its Name\n[[eyes... Eyes... AAAHHH]]\nPeter Sagal wakes Eldritch terror\nPeter Sagal:\"AAAAAAAA\"\n\nWait Wait Even For NPR This Is A Bit Much\nThis American Life to document the road to recovery for those who suffer the trauma of losing on Wait Wait\n\n{{Title text: You can't stab Karl Kasell. He sounds all slow and stentorian, but he moves like a snake.}}", "alt": "You can't stab Carl Kasell. He sounds all slow and stentorian, but he moves like a snake.", "img": "https://imgs.xkcd.com/comics/wait_wait.png", "title": "Wait Wait", "day": "30"}